<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html lang="ja" dir="ltr">
<head>
<title>ソースを表示 - TogoWiki</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta name="generator" content="MediaWiki 1.16.3" />
<meta name="robots" content="noindex,nofollow" />
<link rel="next" href="糖鎖情報のRDF連携について.html" />
<link rel="shortcut icon" href="http://wiki.lifesciencedb.jp/favicon.ico" />
<link rel="search" type="application/opensearchdescription+xml" href="http://wiki.lifesciencedb.jp/mw/opensearch_desc.php" title="TogoWiki (ja)" />
<link rel="copyright" href="http://creativecommons.org/licenses/by/3.0/" />
<link rel="alternate" type="application/atom+xml" title="TogoWikiのAtomフィード" href="http://wiki.lifesciencedb.jp/mw/index.php?title=%E7%89%B9%E5%88%A5:%E6%9C%80%E8%BF%91%E3%81%AE%E6%9B%B4%E6%96%B0&amp;feed=atom" />
<!--[if IE 8]><link rel="stylesheet" href="/mw/skins/common/IE80Fixes.css?270" media="screen" /><![endif]-->
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/skins/common/shared.css?270" media="screen" />
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/skins/common/commonPrint.css?270" media="print" />
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/skins/monobook/main.css?270" media="screen" />
<!--[if lt IE 5.5000]><link rel="stylesheet" href="/mw/skins/monobook/IE50Fixes.css?270" media="screen" /><![endif]-->
<!--[if IE 5.5000]><link rel="stylesheet" href="/mw/skins/monobook/IE55Fixes.css?270" media="screen" /><![endif]-->
<!--[if IE 6]><link rel="stylesheet" href="/mw/skins/monobook/IE60Fixes.css?270" media="screen" /><![endif]-->
<!--[if IE 7]><link rel="stylesheet" href="/mw/skins/monobook/IE70Fixes.css?270" media="screen" /><![endif]-->
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/index.php?title=MediaWiki:Common.css&amp;usemsgcache=yes&amp;ctype=text%2Fcss&amp;smaxage=18000&amp;action=raw&amp;maxage=18000" />
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/index.php?title=MediaWiki:Print.css&amp;usemsgcache=yes&amp;ctype=text%2Fcss&amp;smaxage=18000&amp;action=raw&amp;maxage=18000" media="print" />
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/index.php?title=MediaWiki:Monobook.css&amp;usemsgcache=yes&amp;ctype=text%2Fcss&amp;smaxage=18000&amp;action=raw&amp;maxage=18000" />
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/index.php?title=-&amp;action=raw&amp;maxage=18000&amp;gen=css" />
<script>
var skin="monobook",
stylepath="/mw/skins",
wgUrlProtocols="http\\:\\/\\/|https\\:\\/\\/|ftp\\:\\/\\/|irc\\:\\/\\/|gopher\\:\\/\\/|telnet\\:\\/\\/|nntp\\:\\/\\/|worldwind\\:\\/\\/|mailto\\:|news\\:|svn\\:\\/\\/",
wgArticlePath="/mw/$1",
wgScriptPath="/mw",
wgScriptExtension=".php",
wgScript="/mw/index.php",
wgVariantArticlePath=false,
wgActionPaths={},
wgServer="http://wiki.lifesciencedb.jp",
wgCanonicalNamespace="",
wgCanonicalSpecialPageName=false,
wgNamespaceNumber=0,
wgPageName="糖鎖情報のRDF連携について",
wgTitle="糖鎖情報のRDF連携について",
wgAction="edit",
wgArticleId=805,
wgIsArticle=false,
wgUserName=null,
wgUserGroups=null,
wgUserLanguage="ja",
wgContentLanguage="ja",
wgBreakFrames=true,
wgCurRevisionId=22090,
wgVersion="1.16.3",
wgEnableAPI=true,
wgEnableWriteAPI=true,
wgSeparatorTransformTable=["", ""],
wgDigitTransformTable=["", ""],
wgMainPageTitle="メインページ",
wgFormattedNamespaces={"-2": "メディア", "-1": "特別", "0": "", "1": "ノート", "2": "利用者", "3": "利用者‐会話", "4": "TogoWiki", "5": "TogoWiki‐ノート", "6": "ファイル", "7": "ファイル‐ノート", "8": "MediaWiki", "9": "MediaWiki‐ノート", "10": "Template", "11": "Template‐ノート", "12": "Help", "13": "Help‐ノート", "14": "Category", "15": "Category‐ノート"},
wgNamespaceIds={"メディア": -2, "特別": -1, "": 0, "ノート": 1, "利用者": 2, "利用者‐会話": 3, "togowiki": 4, "togowiki‐ノート": 5, "ファイル": 6, "ファイル‐ノート": 7, "mediawiki": 8, "mediawiki‐ノート": 9, "template": 10, "template‐ノート": 11, "help": 12, "help‐ノート": 13, "category": 14, "category‐ノート": 15, "画像": 6, "画像‐ノート": 7, "image": 6, "image_talk": 7},
wgSiteName="TogoWiki",
wgCategories=[],
wgRestrictionEdit=[],
wgRestrictionMove=[];
</script><script src="http://wiki.lifesciencedb.jp/mw/skins/common/wikibits.js?270"></script>
<script src="http://wiki.lifesciencedb.jp/mw/skins/common/edit.js?270"></script>
<script src="http://wiki.lifesciencedb.jp/mw/skins/common/ajax.js?270"></script>
<script src="http://wiki.lifesciencedb.jp/mw/index.php?title=-&amp;action=raw&amp;gen=js&amp;useskin=monobook&amp;270"></script>

		<style type='text/css'>
		li#pt-openidlogin {
		  background: url(http://wiki.lifesciencedb.jp/mw/extensions/OpenID/skin/icons/openid-inputicon.png) top left no-repeat;
		  padding-left: 20px;
		  text-transform: none;
		}
		</style>
</head>
<body class="mediawiki ltr ns-0 ns-subject page-糖鎖情報のRDF連携について skin-monobook">
<div id="globalWrapper">
<div id="column-content"><div id="content" >
	<a id="top"></a>
	
	<h1 id="firstHeading" class="firstHeading">糖鎖情報のRDF連携について</h1>
	<div id="bodyContent">
		<h3 id="siteSub">提供：TogoWiki</h3>
		<div id="contentSub"><a href="糖鎖情報のRDF連携について.html" title="糖鎖情報のRDF連携について">糖鎖情報のRDF連携について</a>のソース</div>
		<div id="jump-to-nav">移動： <a href="index.php@title=糖鎖情報のRDF連携について&amp;action=edit.html#column-one">案内</a>, <a href="index.php@title=糖鎖情報のRDF連携について&amp;action=edit.html#searchInput">検索</a></div>
		<!-- start content -->
<p>以下に示された理由により、このページの編集を行うことができません：
</p>
<div class="permissions-errors">
<p>この操作は、<a href="http://wiki.lifesciencedb.jp/mw/index.php?title=TogoWiki:%E5%88%A9%E7%94%A8%E8%80%85&amp;action=edit&amp;redlink=1" class="new" title="TogoWiki:利用者（存在しないページ）">利用者</a>のグループに属する利用者のみが実行できます。
</p>
</div>
<p>このページのソースを閲覧し、コピーすることができます：
</p><textarea id="wpTextbox1" name="wpTextbox1" cols="80" rows="25" readonly="">==糖鎖関連遺伝子のデータベース==
* 糖鎖関連遺伝子のデータベース、[http://acgg.asia/ggdb2/ GGDB]（産総研で開発）
** RDF化されている
** RefSeqのリソースURI が使われている。ex. http://identifiers.org/refseq/NP_003024
** UniProt のTaxonomy URI が使われている。ex. http://purl.uniprot.org/taxonomy/9606
* UniProt で利用されているアクセッション番号を含んだ URI は含まれていなかった。
===GGDBのエンドポイントについて===
GGDBのエンドポイントは、2017/5/16現在公開されていない。

== UniProtとの連携を探る ==
===RefSeqのIDから行けるか？===
例として、[http://acgg.asia/ggdb2/gg048 ST3GAL1]を例として UniProt のRDFを見てみる。
* UniProtの検索フォームに、「ST3GAL1」のみを突っ込んだら、当たり前だが、3桁の結果が出てきたので、「NP_003024」をクエリとして投げた。
** http://www.uniprot.org/uniprot/?query=NP_003024&amp;sort=score
* Q11201を選択し、エントリーのRDFを見てみる。
** http://www.uniprot.org/uniprot/Q11201.ttl
* http://identifiers.org/refseq/NP_003024 の記述は、UniProt のRDFでは見つからなかった。
** NP_003024.1というバージョンが入っているものが URIとして利用されていた。
** バージョン情報を含んだURIであれば、連携ができる。


最新のバージョンは、 togows.org を使って取ることができる。
*   http://togows.org/entry/protein/NP_003024/version

== Gene symbol を UniProt Accession にコンバートしてみる ==
* IDをコンバートできるサイト
** http://biodb.jp/
** ID Converterで、HUGO gene symbol —> UniProt Accession ができる

* GGDB の HUGO gene symbol から UniProt Accession へ変換してみる
** ST3GAL1 
*** --> Q11201 (homo sapiense)
* 他の gene symbolからでも、変換してみる
** FUT9 
*** --> B4DEW1 (homo sapiense)
*** --> Q5Q0U2 (homo sapiense)
*** --> Q9BUV6 (homo sapiense)
*** --> Q9Y231 (homo sapiense)

* gene symbolで、対応を取るだけなら、コンバーター使わなくても、SPARQLの文字列マッチでできるはず。


==SPARQL クエリ==
対応を取るための、sparql クエリをつくる。
&lt;pre>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#> 
PREFIX up: &lt;http://purl.uniprot.org/core/> 
PREFIX ggdb:  &lt;http://purl.jp/bio/12/ggdb/2015/6/owl#> 
PREFIX edam:  &lt;http://edamontology.org/> 
PREFIX skos:  &lt;http://www.w3.org/2004/02/skos/core#> 

CONSTRUCT{
	?glycogene a ggdb:Glycogene.
	?glycogene ggdb:has_gene ?up_gene.	
	?up_gene a up:Gene.
}
WHERE{
	?glycogene a ggdb:Glycogene;
		ggdb:has_gene ?gene.

	?gene a edam:data2299;
		rdfs:label ?gene_name.

	SERVICE SILENT &lt;http://sparql.uniprot.org> {
		?up_gene a up:Gene; 
			skos:prefLabel ?gene_name.
	}
}
&lt;/pre>
クエリが正しいかどうか、未確認。。。
* スクリーニングには、いいかもしれない
* キュレーションとしての使用はできない

==Gene symbolで連携==
2017/5/15-16記述
===Federated query===


[https://github.com/aokinobu/docker-virtuoso docker-virtuoso]を使ってローカルで、federated queryを行った。

VirtuosoのConductorにある、ISQLフォームに以下を実行。

&lt;pre>
grant select on "DB.DBA.SPARQL_SINV_2" to "SPARQL";
grant execute on "DB.DBA.SPARQL_SINV_IMP" to "SPARQL";
&lt;/pre>


UniProtのエンドポイントで使えるクエリを拾ってきたので、以下のクエリを実行。
&lt;pre>
SELECT *
WHERE {
  SERVICE &lt;http://sparql.uniprot.org/sparql> {
    &lt;http://purl.uniprot.org/uniprot/P38398> ?p ?o .
  }
}
&lt;/pre>


結果、エンドポイントからの検索結果が表示された。

&lt;pre>
p	o
http://www.w3.org/1999/02/22-rdf-syntax-ns#type	http://purl.uniprot.org/core/Protein
http://www.w3.org/2000/01/rdf-schema#seeAlso	http://purl.uniprot.org/mim/114480
http://www.w3.org/2000/01/rdf-schema#seeAlso	http://purl.uniprot.org/mim/167000
http://www.w3.org/2000/01/rdf-schema#seeAlso	http://purl.uniprot.org/mim/604370
http://www.w3.org/2000/01/rdf-schema#seeAlso	http://purl.uniprot.org/mim/614320
http://www.w3.org/2000/01/rdf-schema#seeAlso	http://purl.uniprot.org/intact/P38398
http://www.w3.org/2000/01/rdf-schema#seeAlso	http://purl.uniprot.org/iptmnet/P38398 
...
&lt;/pre>

===GGDBのRDFをアップロード===

GGDB（FUT9）のRDFをcURLを使って、ローカルのVirtuosoにアップロードする。
*  [http://acgg.asia/ggdb2/gg008 FUT9] : Alpha-(1,3)-fucosyltransferase 9

まずは、GGDB（FUT9）のRDFをダウンロード
&lt;pre>
$ wget http://acgg.asia/ggdb2/gg008.ttl
&lt;/pre>


TTLをcURLで、ローカルのVirtuosoへアップロード (PUT)   

参考：https://virtuoso.openlinksw.com/dataspace/doc/dav/wiki/Main/VirtGraphProtocolCURLExamples
&lt;pre>
$ curl --digest --user dba:dba --verbose --url "http://localhost:8890/sparql-graph-crud-auth?graph-uri=http://rdf.glycoinfo.org/ggdb/fut9" -T gg008.ttl 
&lt;/pre>

RDFが入った模様
&lt;pre>
$ curl --verbose --url "http://localhost:8890/sparql-graph-crud?graph-uri=http://rdf.glycoinfo.org/ggdb/fut9"
*   Trying ::1...
* TCP_NODELAY set
* Connected to localhost (::1) port 8890 (#0)
> GET /sparql-graph-crud?graph-uri=http://rdf.glycoinfo.org/ggdb/fut9 HTTP/1.1
> Host: localhost:8890
> User-Agent: curl/7.51.0
> Accept: */*
> 
&lt; HTTP/1.1 200 OK
&lt; Server: Virtuoso/07.20.3217 (Linux) x86_64-unknown-linux-gnu  
&lt; Connection: Keep-Alive
&lt; Date: Mon, 15 May 2017 08:08:48 GMT
&lt; Accept-Ranges: bytes
&lt; Content-Type: text/turtle; charset=UTF-8
&lt; Content-Length: 36092
&lt; 
@prefix rdf:	&lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix up:	&lt;http://purl.uniprot.org/core/> .
&lt;http://purl.uniprot.org/taxonomy/9606>	rdf:type	up:Taxon .
@prefix rdfs:	&lt;http://www.w3.org/2000/01/rdf-schema#> .
&lt;http://purl.uniprot.org/taxonomy/9606>	rdfs:label	"Homo sapiens" ;
	rdfs:seeAlso	&lt;http://identifiers.org/taxonomy/9606> .
&lt;http://acgg.asia/ggdb2/img/structure/175_JCGG-STR029404.png>	rdfs:label	"175_JCGG-STR029404.png" .
...
&lt;/pre>

===GGDB RDF から rdfs:labelの"FUT9"を取り出す===
2017/5/15記述

GGDBのRDF (FUT9) に記述されている "rdfs:label" から、"FUT9" をSPARQLで取り出せることを確認する。

以下のクエリで"FUT9"を取得。
&lt;pre>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#> 
PREFIX up: &lt;http://purl.uniprot.org/core/> 
PREFIX ggdb:  &lt;http://purl.jp/bio/12/ggdb/2015/6/owl#> 
PREFIX edam:  &lt;http://edamontology.org/> 
PREFIX skos:  &lt;http://www.w3.org/2004/02/skos/core#> 
PREFIX sio: &lt;http://semanticscience.org/resource/>

select distinct *
from &lt;http://rdf.glycoinfo.org/ggdb/fut9>
where{
	?glycogene a ggdb:Glycogene;
		ggdb:has_gene ?gene.
	?gene sio:SIO_000008 ?gene_name.
	?gene_name a edam:data_2299.
	?gene_name rdfs:label ?gene_name_label.
}
&lt;/pre>

以下が、結果。
&lt;pre>
 glycogene  gene	gene_name	gene_name_label 
 http://acgg.asia/ggdb2/gg008  http://acgg.asia/ggdb2/gg008#gene  http://acgg.asia/ggdb2/gg008#genename  "FUT9" 
&lt;/pre>

===UniProtのエンドポイントから、"FUT9"を見つける===
2017/5/16記述

UniProtのエンドポイントから、"FUT9"のラベルを取り出すクエリを作り、結果を確認する。
&lt;pre>
SELECT *
WHERE {
  SERVICE &lt;http://sparql.uniprot.org/sparql> {
    &lt;http://purl.uniprot.org/uniprot/Q9Y231> up:encodedBy ?gene .
    ?gene a up:Gene.
    ?gene skos:prefLabel ?gene_label.
  }
}
&lt;/pre>


以下が、結果。"FUT9"が取れた。
&lt;pre>
gene	gene_label
http://purl.uniprot.org/uniprot/Q9Y231#gene-MD57B4A70848C9654350A86951FBD37C6CC	 "FUT9"
&lt;/pre>


===Federated query その２===

GGDB (FUT9) のRDFに記述されている "FUT9" のラベルから、UniProtのエンドポイント内で紐づいてる情報を取得する。
*   最初は、FROM句でグラフ名を指定していて、うまく行かなかったが、GRAPH句に変えることで解決できた。  
*  参考：[[SPARQLthon20/FederatedQueryTips|SPARQLthon20/FederatedQueryTips]]

&lt;pre>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#> 
PREFIX up: &lt;http://purl.uniprot.org/core/> 
PREFIX ggdb:  &lt;http://purl.jp/bio/12/ggdb/2015/6/owl#> 
PREFIX edam:  &lt;http://edamontology.org/> 
PREFIX skos:  &lt;http://www.w3.org/2004/02/skos/core#> 
PREFIX sio: &lt;http://semanticscience.org/resource/>

select distinct ?gene_name_label ?p ?up_gene
where{
	GRAPH &lt;http://rdf.glycoinfo.org/ggdb/fut9>{
		?glycogene a ggdb:Glycogene.
		?glycogene ggdb:has_gene ?gene.
		?gene sio:SIO_000008 ?gene_name.
		?gene_name a edam:data_2299.
		?gene_name rdfs:label ?gene_name_label.
	}

	SERVICE &lt;http://sparql.uniprot.org/sparql> {
		?up_gene ?p ?gene_name_label.
	}
}
&lt;/pre>


以下が、Federated queryの実行結果。"FUT9"のラベルから、UniProtのエンドポイント内で紐づく情報を取得できた。
&lt;pre>
gene_name_label	p	up_gene
"FUT9"	http://www.w3.org/2000/01/rdf-schema#comment	http://purl.uniprot.org/hgnc/4020
"FUT9"	http://www.w3.org/2000/01/rdf-schema#label	http://purl.uniprot.org/uniparc/UPI00072CFB73
"FUT9"	http://www.w3.org/2000/01/rdf-schema#label	http://purl.uniprot.org/uniprot/A0A0S7I5K1
"FUT9"	http://www.w3.org/2004/02/skos/core#altLabel	http://purl.uniprot.org/uniprot/Q8UWC1#gene-MD5C374E2557F7C5C0DAB401B7CCA409039
"FUT9"	http://www.w3.org/2004/02/skos/core#prefLabel	http://purl.uniprot.org/RefSeq/XP_007052844.1#gene-FUT9
.... (prefLabel を使った記述が続く・・)	
"FUT9"	http://www.w3.org/1999/02/22-rdf-syntax-ns#object	http://purl.uniprot.org/uniprot/#_13E673249AF8AF8F_FFA56BCD0169E5A3_FUT9
.... (object を使った記述が続く・・)	
"FUT9"	http://purl.uniprot.org/core/fullName	http://purl.uniprot.org/uniprot/A0A0S7I5K1#SIPE22BE32823D800F3
"FUT9"	http://purl.uniprot.org/core/structuredNameType	http://purl.uniprot.org/EMBL_TSA/JAO48485.1#name-FUT9
"FUT9"	http://purl.uniprot.org/core/structuredNameType	http://purl.uniprot.org/embl-cds/AIC55837.1#name-FUT9
&lt;/pre>

===Federated query その３===
UniProtの "up:Protein" クラスを指定した場合、このクラスのインスタンスはどうなっているのか？

&lt;pre>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#> 
PREFIX up: &lt;http://purl.uniprot.org/core/> 
PREFIX ggdb:  &lt;http://purl.jp/bio/12/ggdb/2015/6/owl#> 
PREFIX edam:  &lt;http://edamontology.org/> 
PREFIX skos:  &lt;http://www.w3.org/2004/02/skos/core#> 
PREFIX sio: &lt;http://semanticscience.org/resource/>

SELECT DISTINCT ?gene_name_label ?up_gene ?up_protein ?class
WHERE{
	GRAPH &lt;http://rdf.glycoinfo.org/ggdb/fut9>{
		?glycogene a ggdb:Glycogene.
		?glycogene ggdb:has_gene ?gene.
		?gene sio:SIO_000008 ?gene_name.
		?gene_name a edam:data_2299.
		?gene_name rdfs:label ?gene_name_label.
	}

	SERVICE &lt;http://sparql.uniprot.org/sparql> {
		?up_gene skos:prefLabel ?gene_name_label.
		?up_gene a up:Gene.
		?up_protein up:encodedBy ?up_gene.
		VALUES ?class { up:Protein }
		?up_protein a ?class.
	}
}
&lt;/pre>

実行結果。
&lt;pre>
gene_name_label	   up_gene	up_protein	class
"FUT9"	http://purl.uniprot.org/uniprot/B4DEW1#gene-MD57B4A70848C9654350A86951FBD37C6CC	http://purl.uniprot.org/uniprot/B4DEW1	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/Q5Q0U2#gene-MD5FF41112C1D33A0108C98297E620AC836	http://purl.uniprot.org/uniprot/Q5Q0U2	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/Q9XI77#gene-MD55E3FCA3F8163BAE07C399E9B0898E109	http://purl.uniprot.org/uniprot/Q9XI77	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/Q9Y231#gene-MD57B4A70848C9654350A86951FBD37C6CC	http://purl.uniprot.org/uniprot/Q9Y231	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/A0A0M3LHU2#gene-MD57B4A70848C9654350A86951FBD37C6CC	http://purl.uniprot.org/uniprot/A0A0M3LHU2	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/A0A0M3LIL7#gene-MD57B4A70848C9654350A86951FBD37C6CC	http://purl.uniprot.org/uniprot/A0A0M3LIL7	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/A0A0S7I5K1#gene-MD57B4A70848C9654350A86951FBD37C6CC	http://purl.uniprot.org/uniprot/A0A0S7I5K1	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/A0A0M3LI81#gene-MD57B4A70848C9654350A86951FBD37C6CC	http://purl.uniprot.org/uniprot/A0A0M3LI81	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/A0A0M3LJH3#gene-MD57B4A70848C9654350A86951FBD37C6CC	http://purl.uniprot.org/uniprot/A0A0M3LJH3	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/Q659L0#gene-MD57B4A70848C9654350A86951FBD37C6CC	http://purl.uniprot.org/uniprot/Q659L0	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/Q659L1#gene-MD57B4A70848C9654350A86951FBD37C6CC	http://purl.uniprot.org/uniprot/Q659L1	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/Q8HZR2#gene-MD57B4A70848C9654350A86951FBD37C6CC	http://purl.uniprot.org/uniprot/Q8HZR2	http://purl.uniprot.org/core/Protein
"FUT9"	http://purl.uniprot.org/uniprot/Q9JIG1#gene-MD57B4A70848C9654350A86951FBD37C6CC	http://purl.uniprot.org/uniprot/Q9JIG1	http://purl.uniprot.org/core/Protein
.....
&lt;/pre>

*  絞り込みする必要があるが、何で絞り込むか？

==Gene IDで連携==
2017/5/16記述
===GGDBでGene IDを取得するクエリ===
&lt;pre>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#> 
PREFIX up: &lt;http://purl.uniprot.org/core/> 
PREFIX ggdb:  &lt;http://purl.jp/bio/12/ggdb/2015/6/owl#> 
PREFIX edam:  &lt;http://edamontology.org/> 
PREFIX skos:  &lt;http://www.w3.org/2004/02/skos/core#> 
PREFIX sio: &lt;http://semanticscience.org/resource/>

SELECT DISTINCT *
WHERE{
	GRAPH &lt;http://rdf.glycoinfo.org/ggdb/fut9>{
		?gene_id a edam:data_2295.
		?gene_id dcterms:identifier ?id.
		?gene_id rdfs:seeAlso ?ncbi_gene.
	}
}
&lt;/pre>

===UniProtのエンドポイントで、Gene ID (10690) を取得するクエリ===
&lt;pre>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#> 
PREFIX up: &lt;http://purl.uniprot.org/core/> 
PREFIX ggdb:  &lt;http://purl.jp/bio/12/ggdb/2015/6/owl#> 
PREFIX edam:  &lt;http://edamontology.org/> 
PREFIX skos:  &lt;http://www.w3.org/2004/02/skos/core#> 
PREFIX sio: &lt;http://semanticscience.org/resource/>

SELECT DISTINCT *
WHERE{
	SERVICE &lt;http://sparql.uniprot.org/sparql> {
		&lt;http://purl.uniprot.org/uniprot/Q9Y231> rdfs:seeAlso ?ncbi_gene.
	}
}
&lt;/pre>

===Gene IDで結合するクエリ===
&lt;pre>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#> 
PREFIX up: &lt;http://purl.uniprot.org/core/> 
PREFIX ggdb:  &lt;http://purl.jp/bio/12/ggdb/2015/6/owl#> 
PREFIX edam:  &lt;http://edamontology.org/> 
PREFIX skos:  &lt;http://www.w3.org/2004/02/skos/core#> 
PREFIX sio: &lt;http://semanticscience.org/resource/>

SELECT DISTINCT *
WHERE{
	GRAPH &lt;http://rdf.glycoinfo.org/ggdb/fut9>{
		?gene_id a edam:data_2295.
		?gene_id dcterms:identifier ?id.
		?gene_id rdfs:seeAlso ?ncbi_gene.
	}
	SERVICE &lt;http://sparql.uniprot.org/sparql> {
		?up_protein rdfs:seeAlso ?ncbi_gene.
	}
}
&lt;/pre>

結果
&lt;pre>
gene_id	 id	 ncbi_gene	up_protein
http://acgg.asia/ggdb2/gg008#gene_id   "10690"^^&lt;http://www.w3.org/2001/XMLSchema#int>   http://identifiers.org/ncbigene/10690	http://purl.uniprot.org/uniprot/Q9Y231
&lt;/pre>

*  [http://purl.uniprot.org/uniprot/Q9Y231 Q9Y231]</textarea><div class='templatesUsed'>

</div>
<p id="mw-returnto"><a href="糖鎖情報のRDF連携について.html" title="糖鎖情報のRDF連携について">糖鎖情報のRDF連携について</a>に戻る。</p>
<div class="printfooter">
「<a href="糖鎖情報のRDF連携について.html">http://wiki.lifesciencedb.jp/mw/%E7%B3%96%E9%8E%96%E6%83%85%E5%A0%B1%E3%81%AERDF%E9%80%A3%E6%90%BA%E3%81%AB%E3%81%A4%E3%81%84%E3%81%A6</a>」より作成</div>
		<div id='catlinks' class='catlinks catlinks-allhidden'></div>		<!-- end content -->
				<div class="visualClear"></div>
	</div>
</div></div>
<div id="column-one">
	<div id="p-cactions" class="portlet">
		<h5>表示</h5>
		<div class="pBody">
			<ul>
				 <li id="ca-nstab-main" class="selected"><a href="糖鎖情報のRDF連携について.html" title="本文を表示 [c]" accesskey="c">ページ</a></li>
				 <li id="ca-talk" class="new"><a href="http://wiki.lifesciencedb.jp/mw/index.php?title=%E3%83%8E%E3%83%BC%E3%83%88:%E7%B3%96%E9%8E%96%E6%83%85%E5%A0%B1%E3%81%AERDF%E9%80%A3%E6%90%BA%E3%81%AB%E3%81%A4%E3%81%84%E3%81%A6&amp;action=edit&amp;redlink=1" title="記事についての議論 [t]" accesskey="t">議論</a></li>
				 <li id="ca-viewsource" class="selected"><a href="index.php@title=糖鎖情報のRDF連携について&amp;action=edit.html" title="このページは保護されています。&#10;ページのソースを閲覧できます。 [e]" accesskey="e">ソースを表示</a></li>
				 <li id="ca-history"><a href="index.php@title=糖鎖情報のRDF連携について&amp;action=history.html" title="このページの過去の版 [h]" accesskey="h">履歴</a></li>
			</ul>
		</div>
	</div>
	<div class="portlet" id="p-personal">
		<h5>個人用ツール</h5>
		<div class="pBody">
			<ul>
				<li id="pt-anonuserpage"><a href="http://wiki.lifesciencedb.jp/mw/%E5%88%A9%E7%94%A8%E8%80%85:172.18.8.51" title="自分が編集しているIPアドレスの利用者ページ [.]" accesskey="." class="new">172.18.8.51</a></li>
				<li id="pt-anontalk"><a href="http://wiki.lifesciencedb.jp/mw/%E5%88%A9%E7%94%A8%E8%80%85%E2%80%90%E4%BC%9A%E8%A9%B1:172.18.8.51" title="このIPアドレスからなされた編集についての議論 [n]" accesskey="n" class="new">このIPアドレスのトーク</a></li>
				<li id="pt-anonlogin"><a href="http://wiki.lifesciencedb.jp/mw/index.php?title=%E7%89%B9%E5%88%A5:%E3%83%AD%E3%82%B0%E3%82%A4%E3%83%B3&amp;returnto=%E7%B3%96%E9%8E%96%E6%83%85%E5%A0%B1%E3%81%AERDF%E9%80%A3%E6%90%BA%E3%81%AB%E3%81%A4%E3%81%84%E3%81%A6&amp;returntoquery=action%3Dedit" title="ログインすることが推奨されます。ただし、必須ではありません。 [o]" accesskey="o">ログイン</a></li>
				<li id="pt-openidlogin"><a href="index.php@title=特別%253AOpenIDログイン&amp;returnto=糖鎖情報のRDF連携について.html">OpenIDでログイン</a></li>
			</ul>
		</div>
	</div>
	<div class="portlet" id="p-logo">
		<a style="background-image: url(http://wiki.lifesciencedb.jp/mw/images/togowiki-logo.png);" href="index.html" title="メインページに移動"></a>
	</div>
	<script type="text/javascript"> if (window.isMSIE55) fixalpha(); </script>
	<div class='generated-sidebar portlet' id='p-navigation'>
		<h5>案内</h5>
		<div class='pBody'>
			<ul>
				<li id="n-mainpage-description"><a href="index.html" title="メインページに移動する [z]" accesskey="z">メインページ</a></li>
				<li id="n-portal"><a href="http://wiki.lifesciencedb.jp/mw/TogoWiki:%E3%82%B3%E3%83%9F%E3%83%A5%E3%83%8B%E3%83%86%E3%82%A3%E3%83%BB%E3%83%9D%E3%83%BC%E3%82%BF%E3%83%AB" title="このプロジェクトについて、できること、情報を入手する場所">コミュニティ・ポータル</a></li>
				<li id="n-currentevents"><a href="http://wiki.lifesciencedb.jp/mw/TogoWiki:%E6%9C%80%E8%BF%91%E3%81%AE%E5%87%BA%E6%9D%A5%E4%BA%8B" title="最近の出来事について予備知識を得る">最近の出来事</a></li>
				<li id="n-recentchanges"><a href="http://wiki.lifesciencedb.jp/mw/%E7%89%B9%E5%88%A5:%E6%9C%80%E8%BF%91%E3%81%AE%E6%9B%B4%E6%96%B0" title="ウィキにおける最近の更新の一覧 [r]" accesskey="r">最近の更新</a></li>
				<li id="n-randompage"><a href="http://wiki.lifesciencedb.jp/mw/%E7%89%B9%E5%88%A5:%E3%81%8A%E3%81%BE%E3%81%8B%E3%81%9B%E8%A1%A8%E7%A4%BA" title="無作為に抽出されたページの読み込み [x]" accesskey="x">おまかせ表示</a></li>
				<li id="n-help"><a href="http://wiki.lifesciencedb.jp/mw/Help:%E7%9B%AE%E6%AC%A1" title="情報を得る場所">ヘルプ</a></li>
			</ul>
		</div>
	</div>
	<div id="p-search" class="portlet">
		<h5><label for="searchInput">検索</label></h5>
		<div id="searchBody" class="pBody">
			<form action="http://wiki.lifesciencedb.jp/mw/index.php" id="searchform">
				<input type='hidden' name="title" value="特別:検索"/>
				<input id="searchInput" title="TogoWiki内を検索" accesskey="f" type="search" name="search" />
				<input type='submit' name="go" class="searchButton" id="searchGoButton"	value="表示" title="厳密に一致する名前のページが存在すれば、そのページへ移動します" />&nbsp;
				<input type='submit' name="fulltext" class="searchButton" id="mw-searchButton" value="検索" title="入力された文字列が含まれるページを検索します" />
			</form>
		</div>
	</div>
	<div class="portlet" id="p-tb">
		<h5>ツールボックス</h5>
		<div class="pBody">
			<ul>
				<li id="t-whatlinkshere"><a href="特別%253Aリンク元/糖鎖情報のRDF連携について.html" title="ここにリンクしている全ウィキのページの一覧 [j]" accesskey="j">リンク元</a></li>
				<li id="t-recentchangeslinked"><a href="特別%253A関連ページの更新状況/糖鎖情報のRDF連携について.html" title="このページからリンクしているページの最近の更新 [k]" accesskey="k">関連ページの更新状況</a></li>
<li id="t-specialpages"><a href="http://wiki.lifesciencedb.jp/mw/%E7%89%B9%E5%88%A5:%E7%89%B9%E5%88%A5%E3%83%9A%E3%83%BC%E3%82%B8%E4%B8%80%E8%A6%A7" title="特別ページの一覧 [q]" accesskey="q">特別ページ</a></li>
			</ul>
		</div>
	</div>
</div><!-- end of the left (by default at least) column -->
<div class="visualClear"></div>
<div id="footer">
	<div id="f-poweredbyico"><a href="http://www.mediawiki.org/"><img src="http://wiki.lifesciencedb.jp/mw/skins/common/images/poweredby_mediawiki_88x31.png" height="31" width="88" alt="Powered by MediaWiki" /></a></div>
	<div id="f-copyrightico"><a href="http://creativecommons.org/licenses/by/3.0/"><img src="http://i.creativecommons.org/l/by/3.0/88x31.png" alt="Attribution 3.0 Unported" width="88" height="31" /></a></div>
	<ul id="f-list">
		<li id="privacy"><a href="http://wiki.lifesciencedb.jp/mw/TogoWiki:%E3%83%97%E3%83%A9%E3%82%A4%E3%83%90%E3%82%B7%E3%83%BC%E3%83%BB%E3%83%9D%E3%83%AA%E3%82%B7%E3%83%BC" title="TogoWiki:プライバシー・ポリシー">プライバシー・ポリシー</a></li>
		<li id="about"><a href="http://wiki.lifesciencedb.jp/mw/TogoWiki:TogoWiki%E3%81%AB%E3%81%A4%E3%81%84%E3%81%A6" title="TogoWiki:TogoWikiについて">TogoWikiについて</a></li>
		<li id="disclaimer"><a href="http://wiki.lifesciencedb.jp/mw/TogoWiki:%E5%85%8D%E8%B2%AC%E4%BA%8B%E9%A0%85" title="TogoWiki:免責事項">免責事項</a></li>
	</ul>
</div>
</div>

<script>if (window.runOnloadHook) runOnloadHook();</script>
<!-- Served in 0.371 secs. --></body></html>
