<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html lang="ja" dir="ltr">
<head>
<title>ソースを表示 - TogoWiki</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta name="generator" content="MediaWiki 1.16.3" />
<meta name="robots" content="noindex,nofollow" />
<link rel="next" href="http://wiki.lifesciencedb.jp/mw/BH12.12/SPARQLthon/TogoAnnotation" />
<link rel="shortcut icon" href="/favicon.ico" />
<link rel="search" type="application/opensearchdescription+xml" href="/mw/opensearch_desc.php" title="TogoWiki (ja)" />
<link rel="copyright" href="http://creativecommons.org/licenses/by/3.0/" />
<link rel="alternate" type="application/atom+xml" title="TogoWikiのAtomフィード" href="/mw/index.php?title=%E7%89%B9%E5%88%A5:%E6%9C%80%E8%BF%91%E3%81%AE%E6%9B%B4%E6%96%B0&amp;feed=atom" />
<!--[if IE 8]><link rel="stylesheet" href="/mw/skins/common/IE80Fixes.css?270" media="screen" /><![endif]-->
<link rel="stylesheet" href="/mw/skins/common/shared.css?270" media="screen" />
<link rel="stylesheet" href="/mw/skins/common/commonPrint.css?270" media="print" />
<link rel="stylesheet" href="/mw/skins/monobook/main.css?270" media="screen" />
<!--[if lt IE 5.5000]><link rel="stylesheet" href="/mw/skins/monobook/IE50Fixes.css?270" media="screen" /><![endif]-->
<!--[if IE 5.5000]><link rel="stylesheet" href="/mw/skins/monobook/IE55Fixes.css?270" media="screen" /><![endif]-->
<!--[if IE 6]><link rel="stylesheet" href="/mw/skins/monobook/IE60Fixes.css?270" media="screen" /><![endif]-->
<!--[if IE 7]><link rel="stylesheet" href="/mw/skins/monobook/IE70Fixes.css?270" media="screen" /><![endif]-->
<link rel="stylesheet" href="/mw/index.php?title=MediaWiki:Common.css&amp;usemsgcache=yes&amp;ctype=text%2Fcss&amp;smaxage=18000&amp;action=raw&amp;maxage=18000" />
<link rel="stylesheet" href="/mw/index.php?title=MediaWiki:Print.css&amp;usemsgcache=yes&amp;ctype=text%2Fcss&amp;smaxage=18000&amp;action=raw&amp;maxage=18000" media="print" />
<link rel="stylesheet" href="/mw/index.php?title=MediaWiki:Monobook.css&amp;usemsgcache=yes&amp;ctype=text%2Fcss&amp;smaxage=18000&amp;action=raw&amp;maxage=18000" />
<link rel="stylesheet" href="/mw/index.php?title=-&amp;action=raw&amp;maxage=18000&amp;gen=css" />
<script>
var skin="monobook",
stylepath="/mw/skins",
wgUrlProtocols="http\\:\\/\\/|https\\:\\/\\/|ftp\\:\\/\\/|irc\\:\\/\\/|gopher\\:\\/\\/|telnet\\:\\/\\/|nntp\\:\\/\\/|worldwind\\:\\/\\/|mailto\\:|news\\:|svn\\:\\/\\/",
wgArticlePath="/mw/$1",
wgScriptPath="/mw",
wgScriptExtension=".php",
wgScript="/mw/index.php",
wgVariantArticlePath=false,
wgActionPaths={},
wgServer="http://wiki.lifesciencedb.jp",
wgCanonicalNamespace="",
wgCanonicalSpecialPageName=false,
wgNamespaceNumber=0,
wgPageName="BH12.12/SPARQLthon/TogoAnnotation",
wgTitle="BH12.12/SPARQLthon/TogoAnnotation",
wgAction="edit",
wgArticleId=161,
wgIsArticle=false,
wgUserName=null,
wgUserGroups=null,
wgUserLanguage="ja",
wgContentLanguage="ja",
wgBreakFrames=true,
wgCurRevisionId=9116,
wgVersion="1.16.3",
wgEnableAPI=true,
wgEnableWriteAPI=true,
wgSeparatorTransformTable=["", ""],
wgDigitTransformTable=["", ""],
wgMainPageTitle="メインページ",
wgFormattedNamespaces={"-2": "メディア", "-1": "特別", "0": "", "1": "ノート", "2": "利用者", "3": "利用者‐会話", "4": "TogoWiki", "5": "TogoWiki‐ノート", "6": "ファイル", "7": "ファイル‐ノート", "8": "MediaWiki", "9": "MediaWiki‐ノート", "10": "Template", "11": "Template‐ノート", "12": "Help", "13": "Help‐ノート", "14": "Category", "15": "Category‐ノート"},
wgNamespaceIds={"メディア": -2, "特別": -1, "": 0, "ノート": 1, "利用者": 2, "利用者‐会話": 3, "togowiki": 4, "togowiki‐ノート": 5, "ファイル": 6, "ファイル‐ノート": 7, "mediawiki": 8, "mediawiki‐ノート": 9, "template": 10, "template‐ノート": 11, "help": 12, "help‐ノート": 13, "category": 14, "category‐ノート": 15, "画像": 6, "画像‐ノート": 7, "image": 6, "image_talk": 7},
wgSiteName="TogoWiki",
wgCategories=[],
wgRestrictionEdit=[],
wgRestrictionMove=[];
</script><script src="/mw/skins/common/wikibits.js?270"></script>
<script src="/mw/skins/common/edit.js?270"></script>
<script src="/mw/skins/common/ajax.js?270"></script>
<script src="/mw/index.php?title=-&amp;action=raw&amp;gen=js&amp;useskin=monobook&amp;270"></script>

		<style type='text/css'>
		li#pt-openidlogin {
		  background: url(/mw/extensions/OpenID/skin/icons/openid-inputicon.png) top left no-repeat;
		  padding-left: 20px;
		  text-transform: none;
		}
		</style>
</head>
<body class="mediawiki ltr ns-0 ns-subject page-BH12_12_SPARQLthon_TogoAnnotation skin-monobook">
<div id="globalWrapper">
<div id="column-content"><div id="content" >
	<a id="top"></a>
	
	<h1 id="firstHeading" class="firstHeading">BH12.12/SPARQLthon/TogoAnnotation</h1>
	<div id="bodyContent">
		<h3 id="siteSub">提供：TogoWiki</h3>
		<div id="contentSub"><a href="/mw/BH12.12/SPARQLthon/TogoAnnotation" title="BH12.12/SPARQLthon/TogoAnnotation">BH12.12/SPARQLthon/TogoAnnotation</a>のソース</div>
		<div id="jump-to-nav">移動： <a href="#column-one">案内</a>, <a href="#searchInput">検索</a></div>
		<!-- start content -->
<p>以下に示された理由により、このページの編集を行うことができません：
</p>
<div class="permissions-errors">
<p>この操作は、<a href="/mw/index.php?title=TogoWiki:%E5%88%A9%E7%94%A8%E8%80%85&amp;action=edit&amp;redlink=1" class="new" title="TogoWiki:利用者（存在しないページ）">利用者</a>のグループに属する利用者のみが実行できます。
</p>
</div>
<p>このページのソースを閲覧し、コピーすることができます：
</p><textarea id="wpTextbox1" name="wpTextbox1" cols="80" rows="25" readonly="">== 作業 ==
* TogoAnnotationのRDF化: exportスクリプトRDF出力を実装
&lt;pre>
script/export rdf -o genome
script/export rdf -o gene
script/export rdf -o reference
script/export rdf -o annotation [Todo]
script/export rdf -o bookmark  [Todo]
script/export rdf -o tag  [Todo]
&lt;/pre>

* 4store@localhostへのデータインストール
&lt;pre>
4s-backend-setup tga_v1
4s-backend tga_v1
4s-import -v tga_v1 -M http://togo.annotation.jp tga/genome.ttl tga/gene.ttl tga/reference.ttl tga/annotation.ttl 
&lt;/pre>

* reference/annotation件数を取得するSPARQLテストとRDFデータのバグ取りのイテレーション
&lt;pre>
4s-query tga_v1 -f text &lt; query/genome-reference_count.rq 
4s-query tga_v1 -f text &lt; query/gene-reference_count.rq 
4s-query tga_v1 -f text &lt; query/pubmed-annotations_count.rq 
&lt;/pre>

== SPARQL実例 ==

* query/genome-reference_count.rq ゲノム毎のreference_countを件数の多い順で取得
&lt;pre>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX tga: &lt;http://togo.annotation.jp/sw/>
PREFIX obo: &lt;http://purl.obolibrary.org/obo/>
SELECT 
 * 
WHERE 
{
?genome tga:reference_count ?reference_count.
?genome tga:dsn ?dsn.
?genome rdf:type obo:SO_000034.
} 
ORDER BY DESC(?reference_count)
LIMIT 30
&lt;/pre>

結果
&lt;pre>
?genome	?reference_count	?dsn
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis>	2394	"Synechocystis"
&lt;http://genome.kazusa.or.jp/cyanobase/Anabaena>	905	"Anabaena"
&lt;http://genome.kazusa.or.jp/cyanobase/SYNPCC7942>	775	"SYNPCC7942"
&lt;http://genome.kazusa.or.jp/rhizobase/Bradyrhizobium>	549	"Bradyrhizobium"
&lt;http://genome.kazusa.or.jp/cyanobase/SYNPCC7002>	250	"SYNPCC7002"
&lt;http://genome.kazusa.or.jp/cyanobase/Thermo>	250	"Thermo"
&lt;http://genome.kazusa.or.jp/rhizobase/Sinorhizobium>	240	"Sinorhizobium"
&lt;http://genome.kazusa.or.jp/cyanobase/Chlorobium>	143	"Chlorobium"
&lt;http://genome.kazusa.or.jp/cyanobase/NPUN>	137	"NPUN"
&lt;http://genome.kazusa.or.jp/rhizobase/Mesorhizobium>	115	"Mesorhizobium"
&lt;http://streptomyces.nih.go.jp/gview>	111	"NBRC133050"
&lt;http://genome.kazusa.or.jp/cyanobase/AVA>	109	"AVA"
&lt;http://genome.kazusa.or.jp/rhizobase/NGR234>	107	"NGR234"
&lt;http://genome.kazusa.or.jp/rhizobase/Leguminosarum>	83	"Leguminosarum"
&lt;http://genome.kazusa.or.jp/cyanobase/MED4>	58	"MED4"
&lt;http://genome.kazusa.or.jp/cyanobase/Gloeobacter>	44	"Gloeobacter"
&lt;http://genome.kazusa.or.jp/cyanobase/MIT9313>	40	"MIT9313"
&lt;http://genome.kazusa.or.jp/cyanobase/SS120>	34	"SS120"
&lt;http://genome.kazusa.or.jp/rhizobase/NGR234abc>	8	"NGR234abc"
&lt;http://genome.kazusa.or.jp/cyanobase/NIES39>	7	"NIES39"
&lt;http://genome.kazusa.or.jp/cyanobase/WH8102>	4	"WH8102"
&lt;http://genome.kazusa.or.jp/cyanobase/TERY>	1	"TERY"
&lt;http://genome.kazusa.or.jp/cyanobase/PCC6301>	1	"PCC6301"
&lt;http://genome.kazusa.or.jp/cyanobase/P9303>	0	"P9303"
&lt;http://genome.kazusa.or.jp/rhizobase/FRANEAN1>	0	"FRANEAN1"
&lt;http://genome.kazusa.or.jp/rhizobase/FRANCCI3>	0	"FRANCCI3"
&lt;http://genome.kazusa.or.jp/cyanobase/NATL1>	0	"NATL1"
&lt;http://genome.kazusa.or.jp/cyanobase/P9215>	0	"P9215"
&lt;http://genome.kazusa.or.jp/rhizobase/Etli>	0	"Etli"
&lt;http://genome.kazusa.or.jp/rhizobase/ORS571>	0	"ORS571"
#EOR
&lt;/pre>

* query/gene-reference_count.rq 遺伝子毎のreference_countを件数の多い順で取得
&lt;pre>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#>
PREFIX tga: &lt;http://togo.annotation.jp/sw/>
PREFIX obo: &lt;http://purl.obolibrary.org/obo/>
SELECT 
?gene ?annotation_id ?reference_count ?annotation_count ?last_bookmarked_at ?label 
WHERE 
{
?gene tga:reference_count ?reference_count.
?gene tga:annotation_id ?annotation_id.
?gene tga:annotation_count ?annotation_count.
?gene tga:last_bookmarked_at ?last_bookmarked_at.
?gene rdfs:label ?label.
?gene rdf:type obo:SO_0000704.
} 
ORDER BY DESC(?reference_count)
LIMIT 30
&lt;/pre>
結果
&lt;pre>
?gene	?annotation_id	?reference_count	?annotation_count	?last_bookmarked_at	?label
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/slr1311>	&lt;http://togo.annotation.jp/annotations/86386>	430	2212	1351220054	"psbA2, psba-2, psbA, psbAII"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/sll1867>	&lt;http://togo.annotation.jp/annotations/86385>	362	1587	1340503463	"psbA3, psba-3, psbA, psbAIII"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/slr1181>	&lt;http://togo.annotation.jp/annotations/86384>	343	1430	1340503642	"psbA1, psba-1, psbA, psbAI"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/sll0849>	&lt;http://togo.annotation.jp/annotations/86417>	289	1129	1321521079	"psbD1, psbD, psbD-1, psbDI"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/sll0851>	&lt;http://togo.annotation.jp/annotations/86659>	275	1059	1321521184	"psbC"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/slr0906>	&lt;http://togo.annotation.jp/annotations/85206>	257	1043	1351042495	"psbB"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/slr1834>	&lt;http://togo.annotation.jp/annotations/85191>	250	1097	1321520766	"psaA"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/slr0927>	&lt;http://togo.annotation.jp/annotations/86418>	250	864	1321521272	"psbD2, psbD, psbD-2, psbDII"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/slr1835>	&lt;http://togo.annotation.jp/annotations/85420>	240	1096	1321520918	"psaB"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/slr0737>	&lt;http://togo.annotation.jp/annotations/85197>	163	671	1318718649	"psaD"
&lt;http://genome.kazusa.or.jp/cyanobase/Anabaena/genes/alr4392>	&lt;http://togo.annotation.jp/annotations/83251>	157	732	1350976117	"ntcA, bifA, VF1"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/sll0427>	&lt;http://togo.annotation.jp/annotations/85956>	153	675	1351042996	"psbO"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/ssl0563>	&lt;http://togo.annotation.jp/annotations/85209>	139	551	1319021431	"psaC, psaC2"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/ssr3451>	&lt;http://togo.annotation.jp/annotations/86674>	138	484	1351037253	"psbE"
&lt;http://genome.kazusa.or.jp/cyanobase/Anabaena/genes/alr2339>	&lt;http://togo.annotation.jp/annotations/83361>	136	766	1349940899	"hetR, alr2339"
&lt;http://genome.kazusa.or.jp/cyanobase/SYNPCC7942/genes/Synpcc7942_0424>	&lt;http://togo.annotation.jp/annotations/88868>	133	697	1349152383	"psbAI, psbA, psbA1, psbA-I, ps2B, Synpcc7942_0424"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/ssr2831>	&lt;http://togo.annotation.jp/annotations/85199>	131	575	1318718592	"psaE"
&lt;http://genome.kazusa.or.jp/cyanobase/Anabaena/genes/all1455>	&lt;http://togo.annotation.jp/annotations/84072>	129	417	1348469613	"nifH, all1455"
&lt;http://streptomyces.nih.go.jp/>	&lt;http://togo.annotation.jp/annotations/148044>	126	912	1351178853	"crt"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/smr0006>	&lt;http://togo.annotation.jp/annotations/86686>	121	418	1319710867	"psbF"
&lt;http://genome.kazusa.or.jp/cyanobase/Anabaena/genes/all1454N>	&lt;http://togo.annotation.jp/annotations/84532>	108	390	1348469753	"nifD"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/sll0819>	&lt;http://togo.annotation.jp/annotations/89515>	108	426	1316885994	"psaF"
&lt;http://genome.kazusa.or.jp/cyanobase/Anabaena/genes/all1454C>	&lt;http://togo.annotation.jp/annotations/84533>	107	369	1348469927	"nifD"
&lt;http://genome.kazusa.or.jp/cyanobase/synpcc7942/genes/Synpcc7942_1389>	&lt;http://togo.annotation.jp/annotations/63477>	105	502	1348980402	"psbAII, psbA, psbA2, ps2B"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/sll1577>	&lt;http://togo.annotation.jp/annotations/85186>	103	354	1315317095	"cpcB"
&lt;http://genome.kazusa.or.jp/cyanobase/Anabaena/genes/all1440>	&lt;http://togo.annotation.jp/annotations/65137>	99	256	1347972417	"nifK"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/sll0247>	&lt;http://togo.annotation.jp/annotations/86241>	98	446	1349151744	"isiA, psbC"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/slr2076>	&lt;http://togo.annotation.jp/annotations/90605>	97	334	1337685669	"groEL1, cpn60-1, groEL, groEL-1, slr2076"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/slr0009>	&lt;http://togo.annotation.jp/annotations/86407>	96	338	1325674864	"rbcL, slr0009"
&lt;http://genome.kazusa.or.jp/cyanobase/Synechocystis/genes/sll1578>	&lt;http://togo.annotation.jp/annotations/85185>	96	350	1325630872	"cpcA, sll1578"
#EOR
&lt;/pre>

* query/pubmed-annotations_count.rq 文献毎のannotation_countを件数の多い順で取得
&lt;pre>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#>
PREFIX tga: &lt;http://togo.annotation.jp/sw/>
PREFIX obo: &lt;http://purl.obolibrary.org/obo/>
SELECT 
?journal ?tag_id ?annotations_count ?journal_title
WHERE 
{
?journal tga:annotations_count ?annotations_count.
?journal tga:tag_id ?tag_id.
?journal rdf:type tga:JournalPublication.
?journal tga:title ?journal_title
} 
ORDER BY DESC(?annotations_count)
LIMIT 30
&lt;/pre>

結果
&lt;pre>
?journal	?tag_id	?annotations_count	?journal_title
&lt;http://pubmed.org/18000013>	&lt;http://togo.annotation.jp/tags/24309>	10374	"A large-scale protein protein interaction analysis in Synechocystis sp. PCC6803."
&lt;http://pubmed.org/12597279>	&lt;http://togo.annotation.jp/tags/203400>	8465	"Complete genomic sequence of nitrogen-fixing symbiotic bacterium Bradyrhizobium japonicum USDA110 (supplement)."
&lt;http://pubmed.org/18192278>	&lt;http://togo.annotation.jp/tags/24316>	7984	"A large scale analysis of protein-protein interactions in the nitrogen-fixing bacterium Mesorhizobium loti."
&lt;http://pubmed.org/14621296>	&lt;http://togo.annotation.jp/tags/209836>	4687	"Complete genome structure of Gloeobacter violaceus PCC 7421, a cyanobacterium that lacks thylakoids (supplement)."
&lt;http://pubmed.org/12240836>	&lt;http://togo.annotation.jp/tags/205290>	2728	"Complete genome structure of the thermophilic cyanobacterium Thermosynechococcus elongatus BP-1 (supplement)."
&lt;http://pubmed.org/14612435>	&lt;http://togo.annotation.jp/tags/29654>	1333	"Alterations in global patterns of gene expression in Synechocystis sp. PCC 6803 in response to inorganic carbon limitation and the inactivation of ndhR, a LysR family regulator."
&lt;http://pubmed.org/12446635>	&lt;http://togo.annotation.jp/tags/18871>	1100	"Global gene expression profiles of the cyanobacterium Synechocystis sp. strain PCC 6803 in response to irradiation with UV-B and white light."
&lt;http://pubmed.org/9163424>	&lt;http://togo.annotation.jp/tags/203944>	1085	"Molecular basis of symbiosis between Rhizobium and legumes."
&lt;http://pubmed.org/14702322>	&lt;http://togo.annotation.jp/tags/30019>	1060	"An evolutionary hot spot: the pNGR234b replicon of Rhizobium sp. strain NGR234."
&lt;http://pubmed.org/19216801>	&lt;http://togo.annotation.jp/tags/204622>	958	"The time course of the transcriptomic response of Sinorhizobium meliloti 1021 following a shift to acidic pH."
&lt;http://pubmed.org/11283337>	&lt;http://togo.annotation.jp/tags/17750>	852	"DNA microarray analysis of cyanobacterial gene expression during acclimation to high light."
&lt;http://pubmed.org/18511436>	&lt;http://togo.annotation.jp/tags/203244>	726	"Soybean seed extracts preferentially express genomic loci of Bradyrhizobium japonicum in the initial interaction with soybean, Glycine max (L.) Merr."
&lt;http://pubmed.org/15289483>	&lt;http://togo.annotation.jp/tags/29838>	701	"Elucidation of gene interaction networks through time-lagged correlation analysis of transcriptional data."
&lt;http://pubmed.org/11858227>	&lt;http://togo.annotation.jp/tags/32628>	694	"Characterization of genes encoding multi-domain proteins in the genome of the filamentous nitrogen-fixing Cyanobacterium anabaena sp. strain PCC 7120."
&lt;http://pubmed.org/17164256>	&lt;http://togo.annotation.jp/tags/34005>	666	"Genome-wide analysis of ATP-binding cassette (ABC) proteins in a model legume plant, Lotus japonicus: comparison with Arabidopsis ABC protein family."
&lt;http://pubmed.org/17600135>	&lt;http://togo.annotation.jp/tags/18664>	654	"Long-term response toward inorganic carbon limitation in wild type and glycolate turnover mutants of the cyanobacterium Synechocystis sp. strain PCC 6803."
&lt;http://pubmed.org/20203057>	&lt;http://togo.annotation.jp/tags/208125>	647	"Genomic structure of an economically important cyanobacterium, Arthrospira (Spirulina) platensis NIES-39."
&lt;http://pubmed.org/12886952>	&lt;http://togo.annotation.jp/tags/32575>	598	"Genome-wide expression analysis of the responses to nitrogen deprivation in the heterocyst-forming cyanobacterium Anabaena sp. strain PCC 7120."
&lt;http://pubmed.org/12480098>	&lt;http://togo.annotation.jp/tags/18903>	595	"Genomic analysis of protein kinases, protein phosphatases and two-component regulatory systems of the cyanobacterium Anabaena sp. strain PCC 7120."
&lt;http://pubmed.org/15000396>	&lt;http://togo.annotation.jp/tags/34187>	590	"Global changes in gene expression in Sinorhizobium meliloti 1021 under microoxic and symbiotic conditions."
&lt;http://pubmed.org/12913140>	&lt;http://togo.annotation.jp/tags/18975>	557	"Microarray analysis of the genome-wide response to iron deficiency and iron reconstitution in the cyanobacterium Synechocystis sp. PCC 6803."
&lt;http://pubmed.org/15141946>	&lt;http://togo.annotation.jp/tags/30107>	551	"Genome-wide comparison of the His-to-Asp phosphorelay signaling components of three symbiotic genera of Rhizobia."
&lt;http://pubmed.org/17337580>	&lt;http://togo.annotation.jp/tags/210988>	520	"A-factor and phosphate depletion signals are transmitted to the grixazone biosynthesis genes via the pathway-specific transcriptional activator GriR."
&lt;http://pubmed.org/15221452>	&lt;http://togo.annotation.jp/tags/34120>	507	"Global transcriptional analysis of the phosphate starvation response in Sinorhizobium meliloti strains 1021 and 2011."
&lt;http://pubmed.org/9298645>	&lt;http://togo.annotation.jp/tags/208039>	499	"Towards a proteome project of cyanobacterium Synechocystis sp. strain PCC6803: linking 130 protein spots with their respective genes."
&lt;http://pubmed.org/16622784>	&lt;http://togo.annotation.jp/tags/203775>	482	"High throughput two-dimensional blue-native electrophoresis: a tool for functional proteomics of cytoplasmatic protein complexes from Chlorobium tepidum."
&lt;http://pubmed.org/8581740>	&lt;http://togo.annotation.jp/tags/205899>	466	"Assignment of 82 known genes and gene clusters on the genome of the unicellular cyanobacterium Synechocystis sp. strain PCC6803."
&lt;http://pubmed.org/12795377>	&lt;http://togo.annotation.jp/tags/67269>	454	"A global analysis of protein expression profiles in Sinorhizobium meliloti: discovery of new genes for nodule occupancy and stress adaptation."
&lt;http://pubmed.org/16159767>	&lt;http://togo.annotation.jp/tags/211441>	454	"Three chymotrypsin genes are members of the AdpA regulon in the A-factor regulatory cascade in Streptomyces griseus."
&lt;http://pubmed.org/14686584>	&lt;http://togo.annotation.jp/tags/19082>	449	"Structural analysis of four large plasmids harboring in a unicellular cyanobacterium, Synechocystis sp. PCC 6803."
#EOR
&lt;/pre>

== Todo ==
* RDF作成【済】
** script/exportでannotation, bookmark, tagのRDF出力 【済】
** 親タグ表現→同種タグセットの取得するクエリーは利用頻度が高そうなのでrdf:type で表現しておく【済】
* virtuosoにデータインポート【済】
* RDF更新
** pubmed URIをhttp://identifiers.org/pubmed/ に置き換える Genome-RDF, 菌株reference情報表現とそろえる【SPARQLthon2】
** voidでメタデータを記述する
* SPARQL
** CyanoBaseとのjoin
** MicrobeDB.jp関連DBとのjoin
** 文献情報とのjoin (journal title, authorなど)
** dbpediaとのjoin 例）http://live.dbpedia.org/page/DNA_polymerase

[[Category:TogoAnnotation]]</textarea><div class='templatesUsed'>

</div>
<p id="mw-returnto"><a href="/mw/BH12.12/SPARQLthon/TogoAnnotation" title="BH12.12/SPARQLthon/TogoAnnotation">BH12.12/SPARQLthon/TogoAnnotation</a>に戻る。</p>
<div class="printfooter">
「<a href="http://wiki.lifesciencedb.jp/mw/BH12.12/SPARQLthon/TogoAnnotation">http://wiki.lifesciencedb.jp/mw/BH12.12/SPARQLthon/TogoAnnotation</a>」より作成</div>
		<div id='catlinks' class='catlinks catlinks-allhidden'></div>		<!-- end content -->
				<div class="visualClear"></div>
	</div>
</div></div>
<div id="column-one">
	<div id="p-cactions" class="portlet">
		<h5>表示</h5>
		<div class="pBody">
			<ul>
				 <li id="ca-nstab-main" class="selected"><a href="/mw/BH12.12/SPARQLthon/TogoAnnotation" title="本文を表示 [c]" accesskey="c">ページ</a></li>
				 <li id="ca-talk" class="new"><a href="/mw/index.php?title=%E3%83%8E%E3%83%BC%E3%83%88:BH12.12/SPARQLthon/TogoAnnotation&amp;action=edit&amp;redlink=1" title="記事についての議論 [t]" accesskey="t">議論</a></li>
				 <li id="ca-viewsource" class="selected"><a href="/mw/index.php?title=BH12.12/SPARQLthon/TogoAnnotation&amp;action=edit" title="このページは保護されています。&#10;ページのソースを閲覧できます。 [e]" accesskey="e">ソースを表示</a></li>
				 <li id="ca-history"><a href="/mw/index.php?title=BH12.12/SPARQLthon/TogoAnnotation&amp;action=history" title="このページの過去の版 [h]" accesskey="h">履歴</a></li>
			</ul>
		</div>
	</div>
	<div class="portlet" id="p-personal">
		<h5>個人用ツール</h5>
		<div class="pBody">
			<ul>
				<li id="pt-anonuserpage"><a href="/mw/%E5%88%A9%E7%94%A8%E8%80%85:172.18.8.51" title="自分が編集しているIPアドレスの利用者ページ [.]" accesskey="." class="new">172.18.8.51</a></li>
				<li id="pt-anontalk"><a href="/mw/%E5%88%A9%E7%94%A8%E8%80%85%E2%80%90%E4%BC%9A%E8%A9%B1:172.18.8.51" title="このIPアドレスからなされた編集についての議論 [n]" accesskey="n" class="new">このIPアドレスのトーク</a></li>
				<li id="pt-anonlogin"><a href="/mw/index.php?title=%E7%89%B9%E5%88%A5:%E3%83%AD%E3%82%B0%E3%82%A4%E3%83%B3&amp;returnto=BH12.12/SPARQLthon/TogoAnnotation&amp;returntoquery=action%3Dedit" title="ログインすることが推奨されます。ただし、必須ではありません。 [o]" accesskey="o">ログイン</a></li>
				<li id="pt-openidlogin"><a href="/mw/index.php?title=%E7%89%B9%E5%88%A5:OpenID%E3%83%AD%E3%82%B0%E3%82%A4%E3%83%B3&amp;returnto=BH12.12/SPARQLthon/TogoAnnotation">OpenIDでログイン</a></li>
			</ul>
		</div>
	</div>
	<div class="portlet" id="p-logo">
		<a style="background-image: url(/mw/images/togowiki-logo.png);" href="/mw/%E3%83%A1%E3%82%A4%E3%83%B3%E3%83%9A%E3%83%BC%E3%82%B8" title="メインページに移動"></a>
	</div>
	<script type="text/javascript"> if (window.isMSIE55) fixalpha(); </script>
	<div class='generated-sidebar portlet' id='p-navigation'>
		<h5>案内</h5>
		<div class='pBody'>
			<ul>
				<li id="n-mainpage-description"><a href="/mw/%E3%83%A1%E3%82%A4%E3%83%B3%E3%83%9A%E3%83%BC%E3%82%B8" title="メインページに移動する [z]" accesskey="z">メインページ</a></li>
				<li id="n-portal"><a href="/mw/TogoWiki:%E3%82%B3%E3%83%9F%E3%83%A5%E3%83%8B%E3%83%86%E3%82%A3%E3%83%BB%E3%83%9D%E3%83%BC%E3%82%BF%E3%83%AB" title="このプロジェクトについて、できること、情報を入手する場所">コミュニティ・ポータル</a></li>
				<li id="n-currentevents"><a href="/mw/TogoWiki:%E6%9C%80%E8%BF%91%E3%81%AE%E5%87%BA%E6%9D%A5%E4%BA%8B" title="最近の出来事について予備知識を得る">最近の出来事</a></li>
				<li id="n-recentchanges"><a href="/mw/%E7%89%B9%E5%88%A5:%E6%9C%80%E8%BF%91%E3%81%AE%E6%9B%B4%E6%96%B0" title="ウィキにおける最近の更新の一覧 [r]" accesskey="r">最近の更新</a></li>
				<li id="n-randompage"><a href="/mw/%E7%89%B9%E5%88%A5:%E3%81%8A%E3%81%BE%E3%81%8B%E3%81%9B%E8%A1%A8%E7%A4%BA" title="無作為に抽出されたページの読み込み [x]" accesskey="x">おまかせ表示</a></li>
				<li id="n-help"><a href="/mw/Help:%E7%9B%AE%E6%AC%A1" title="情報を得る場所">ヘルプ</a></li>
			</ul>
		</div>
	</div>
	<div id="p-search" class="portlet">
		<h5><label for="searchInput">検索</label></h5>
		<div id="searchBody" class="pBody">
			<form action="/mw/index.php" id="searchform">
				<input type='hidden' name="title" value="特別:検索"/>
				<input id="searchInput" title="TogoWiki内を検索" accesskey="f" type="search" name="search" />
				<input type='submit' name="go" class="searchButton" id="searchGoButton"	value="表示" title="厳密に一致する名前のページが存在すれば、そのページへ移動します" />&nbsp;
				<input type='submit' name="fulltext" class="searchButton" id="mw-searchButton" value="検索" title="入力された文字列が含まれるページを検索します" />
			</form>
		</div>
	</div>
	<div class="portlet" id="p-tb">
		<h5>ツールボックス</h5>
		<div class="pBody">
			<ul>
				<li id="t-whatlinkshere"><a href="/mw/%E7%89%B9%E5%88%A5:%E3%83%AA%E3%83%B3%E3%82%AF%E5%85%83/BH12.12/SPARQLthon/TogoAnnotation" title="ここにリンクしている全ウィキのページの一覧 [j]" accesskey="j">リンク元</a></li>
				<li id="t-recentchangeslinked"><a href="/mw/%E7%89%B9%E5%88%A5:%E9%96%A2%E9%80%A3%E3%83%9A%E3%83%BC%E3%82%B8%E3%81%AE%E6%9B%B4%E6%96%B0%E7%8A%B6%E6%B3%81/BH12.12/SPARQLthon/TogoAnnotation" title="このページからリンクしているページの最近の更新 [k]" accesskey="k">関連ページの更新状況</a></li>
<li id="t-specialpages"><a href="/mw/%E7%89%B9%E5%88%A5:%E7%89%B9%E5%88%A5%E3%83%9A%E3%83%BC%E3%82%B8%E4%B8%80%E8%A6%A7" title="特別ページの一覧 [q]" accesskey="q">特別ページ</a></li>
			</ul>
		</div>
	</div>
</div><!-- end of the left (by default at least) column -->
<div class="visualClear"></div>
<div id="footer">
	<div id="f-poweredbyico"><a href="http://www.mediawiki.org/"><img src="/mw/skins/common/images/poweredby_mediawiki_88x31.png" height="31" width="88" alt="Powered by MediaWiki" /></a></div>
	<div id="f-copyrightico"><a href="http://creativecommons.org/licenses/by/3.0/"><img src="http://i.creativecommons.org/l/by/3.0/88x31.png" alt="Attribution 3.0 Unported" width="88" height="31" /></a></div>
	<ul id="f-list">
		<li id="privacy"><a href="/mw/TogoWiki:%E3%83%97%E3%83%A9%E3%82%A4%E3%83%90%E3%82%B7%E3%83%BC%E3%83%BB%E3%83%9D%E3%83%AA%E3%82%B7%E3%83%BC" title="TogoWiki:プライバシー・ポリシー">プライバシー・ポリシー</a></li>
		<li id="about"><a href="/mw/TogoWiki:TogoWiki%E3%81%AB%E3%81%A4%E3%81%84%E3%81%A6" title="TogoWiki:TogoWikiについて">TogoWikiについて</a></li>
		<li id="disclaimer"><a href="/mw/TogoWiki:%E5%85%8D%E8%B2%AC%E4%BA%8B%E9%A0%85" title="TogoWiki:免責事項">免責事項</a></li>
	</ul>
</div>
</div>

<script>if (window.runOnloadHook) runOnloadHook();</script>
<!-- Served in 0.333 secs. --></body></html>
