<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html lang="ja" dir="ltr">
<head>
<title>ソースを表示 - TogoWiki</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta name="generator" content="MediaWiki 1.16.3" />
<meta name="robots" content="noindex,nofollow" />
<link rel="next" href="データベースのRDF化.html" />
<link rel="shortcut icon" href="http://wiki.lifesciencedb.jp/favicon.ico" />
<link rel="search" type="application/opensearchdescription+xml" href="http://wiki.lifesciencedb.jp/mw/opensearch_desc.php" title="TogoWiki (ja)" />
<link rel="copyright" href="http://creativecommons.org/licenses/by/3.0/" />
<link rel="alternate" type="application/atom+xml" title="TogoWikiのAtomフィード" href="http://wiki.lifesciencedb.jp/mw/index.php?title=%E7%89%B9%E5%88%A5:%E6%9C%80%E8%BF%91%E3%81%AE%E6%9B%B4%E6%96%B0&amp;feed=atom" />
<!--[if IE 8]><link rel="stylesheet" href="/mw/skins/common/IE80Fixes.css?270" media="screen" /><![endif]-->
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/skins/common/shared.css?270" media="screen" />
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/skins/common/commonPrint.css?270" media="print" />
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/skins/monobook/main.css?270" media="screen" />
<!--[if lt IE 5.5000]><link rel="stylesheet" href="/mw/skins/monobook/IE50Fixes.css?270" media="screen" /><![endif]-->
<!--[if IE 5.5000]><link rel="stylesheet" href="/mw/skins/monobook/IE55Fixes.css?270" media="screen" /><![endif]-->
<!--[if IE 6]><link rel="stylesheet" href="/mw/skins/monobook/IE60Fixes.css?270" media="screen" /><![endif]-->
<!--[if IE 7]><link rel="stylesheet" href="/mw/skins/monobook/IE70Fixes.css?270" media="screen" /><![endif]-->
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/index.php?title=MediaWiki:Common.css&amp;usemsgcache=yes&amp;ctype=text%2Fcss&amp;smaxage=18000&amp;action=raw&amp;maxage=18000" />
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/index.php?title=MediaWiki:Print.css&amp;usemsgcache=yes&amp;ctype=text%2Fcss&amp;smaxage=18000&amp;action=raw&amp;maxage=18000" media="print" />
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/index.php?title=MediaWiki:Monobook.css&amp;usemsgcache=yes&amp;ctype=text%2Fcss&amp;smaxage=18000&amp;action=raw&amp;maxage=18000" />
<link rel="stylesheet" href="http://wiki.lifesciencedb.jp/mw/index.php?title=-&amp;action=raw&amp;maxage=18000&amp;gen=css" />
<script>
var skin="monobook",
stylepath="/mw/skins",
wgUrlProtocols="http\\:\\/\\/|https\\:\\/\\/|ftp\\:\\/\\/|irc\\:\\/\\/|gopher\\:\\/\\/|telnet\\:\\/\\/|nntp\\:\\/\\/|worldwind\\:\\/\\/|mailto\\:|news\\:|svn\\:\\/\\/",
wgArticlePath="/mw/$1",
wgScriptPath="/mw",
wgScriptExtension=".php",
wgScript="/mw/index.php",
wgVariantArticlePath=false,
wgActionPaths={},
wgServer="http://wiki.lifesciencedb.jp",
wgCanonicalNamespace="",
wgCanonicalSpecialPageName=false,
wgNamespaceNumber=0,
wgPageName="データベースのRDF化",
wgTitle="データベースのRDF化",
wgAction="edit",
wgArticleId=41,
wgIsArticle=false,
wgUserName=null,
wgUserGroups=null,
wgUserLanguage="ja",
wgContentLanguage="ja",
wgBreakFrames=true,
wgCurRevisionId=788,
wgVersion="1.16.3",
wgEnableAPI=true,
wgEnableWriteAPI=true,
wgSeparatorTransformTable=["", ""],
wgDigitTransformTable=["", ""],
wgMainPageTitle="メインページ",
wgFormattedNamespaces={"-2": "メディア", "-1": "特別", "0": "", "1": "ノート", "2": "利用者", "3": "利用者‐会話", "4": "TogoWiki", "5": "TogoWiki‐ノート", "6": "ファイル", "7": "ファイル‐ノート", "8": "MediaWiki", "9": "MediaWiki‐ノート", "10": "Template", "11": "Template‐ノート", "12": "Help", "13": "Help‐ノート", "14": "Category", "15": "Category‐ノート"},
wgNamespaceIds={"メディア": -2, "特別": -1, "": 0, "ノート": 1, "利用者": 2, "利用者‐会話": 3, "togowiki": 4, "togowiki‐ノート": 5, "ファイル": 6, "ファイル‐ノート": 7, "mediawiki": 8, "mediawiki‐ノート": 9, "template": 10, "template‐ノート": 11, "help": 12, "help‐ノート": 13, "category": 14, "category‐ノート": 15, "画像": 6, "画像‐ノート": 7, "image": 6, "image_talk": 7},
wgSiteName="TogoWiki",
wgCategories=[],
wgRestrictionEdit=[],
wgRestrictionMove=[];
</script><script src="http://wiki.lifesciencedb.jp/mw/skins/common/wikibits.js?270"></script>
<script src="http://wiki.lifesciencedb.jp/mw/skins/common/edit.js?270"></script>
<script src="http://wiki.lifesciencedb.jp/mw/skins/common/ajax.js?270"></script>
<script src="http://wiki.lifesciencedb.jp/mw/index.php?title=-&amp;action=raw&amp;gen=js&amp;useskin=monobook&amp;270"></script>

		<style type='text/css'>
		li#pt-openidlogin {
		  background: url(http://wiki.lifesciencedb.jp/mw/extensions/OpenID/skin/icons/openid-inputicon.png) top left no-repeat;
		  padding-left: 20px;
		  text-transform: none;
		}
		</style>
</head>
<body class="mediawiki ltr ns-0 ns-subject page-データベースのRDF化 skin-monobook">
<div id="globalWrapper">
<div id="column-content"><div id="content" >
	<a id="top"></a>
	
	<h1 id="firstHeading" class="firstHeading">データベースのRDF化</h1>
	<div id="bodyContent">
		<h3 id="siteSub">提供：TogoWiki</h3>
		<div id="contentSub"><a href="データベースのRDF化.html" title="データベースのRDF化">データベースのRDF化</a>のソース</div>
		<div id="jump-to-nav">移動： <a href="index.php@title=データベースのRDF化&amp;action=edit.html#column-one">案内</a>, <a href="index.php@title=データベースのRDF化&amp;action=edit.html#searchInput">検索</a></div>
		<!-- start content -->
<p>以下に示された理由により、このページの編集を行うことができません：
</p>
<div class="permissions-errors">
<p>この操作は、<a href="http://wiki.lifesciencedb.jp/mw/index.php?title=TogoWiki:%E5%88%A9%E7%94%A8%E8%80%85&amp;action=edit&amp;redlink=1" class="new" title="TogoWiki:利用者（存在しないページ）">利用者</a>のグループに属する利用者のみが実行できます。
</p>
</div>
<p>このページのソースを閲覧し、コピーすることができます：
</p><textarea id="wpTextbox1" name="wpTextbox1" cols="80" rows="25" readonly="">ショートカット： http://wiki.lifesciencedb.jp/mw/index.php/BH10.10

= 参加者 =
* 金城玲 (PDBj)
* 村上勝彦 (JBiC)

= 開始前の状況 =
PDBj と H-inv DBのRDF化

PDBj に関してはほぼ出来上がっている。

H-inv DBはこれから調べて考える。

= やるべきことのリスト =

* OWL でオントロジーを定義する
* データベースのデータをRDFに変換する。
* RDF store にデータをロードする。
* 適当なクエリを投げてみる。

以上。

== PDBj の場合 ==
* PDBMLのスキーマ pdbx-v32.xsd がある。
* スタイルシートを作って、pdbx-v32.xsd から pdbx-v32.owl (OWLオントロジー)を作る。
** pdbx-v32.xsd -> (pdbx2owl.xsl) -> pdbx-v32.owl
* スタイルシートを作って、pdbx-v32.xsd から RDFをつくるためのスタイルシートを作る。
** pdbx-v32.xsd -> (pdbx2pdbml2rdf.xsl) -> PDBML2rdf.xsl
* 前段階で生成されたスタイルシートをつかって、PDBMLをRDFに変換する。
** 1gof.xml (一例) -> (PDBML2rdf.xsl) -> 1gof.rdf

== H-invDB の場合 ==
* XML スキーマがないので、手でOWLオントロジーを書く必要がある？
* とりあえず、HIPのXMLファイルを直接RDFに変換するXSLを書くことにする。

= Use case =
H-invDBとPDBをつないで面白いクエリを作る。
* ある染色体領域にコードされている蛋白質でで構造が決定されているものをリストする。
* あるいはその逆。

=== ちょっとした注意点 ===
* H-invDBではPDBのIDがchain IDやSCOPのドメイン IDを連結して書かれている（例：1a00A, 2bduA1など）。これは困る。
* H-invDBのXMLにはバグがある。特殊文字がエスケープされていない。"&amp;" とか "&lt;" とか ">" とか"&lt;gamma>"　がある。

== SPARQL クエリの例 ==
=== H-invDB のとある染色体領域(CHROMOSOME-BAND)にある蛋白質でPDBエントリが存在するものを探して、PDBのアノテーションと一緒に列挙する ===
&lt;pre>
prefix PDBo: &lt;http://www.pdbj.org/schema/pdbx-v32.owl#>
prefix Hinv: &lt;http://hinv.jp/hinv.owl#>
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#>

select ?band ?pdbid ?title  where {
 ?s Hinv:CHROMOSOME-BAND ?band .
 ?s Hinv:STRUCTURE_DB-REFERENCE_PDB ?pdbid .
 ?pdbidU rdfs:sameAs ?pdbid .
 ?pdbidU PDBo:structCategory  ?struct .
 ?struct PDBo:struct.title ?title .
}
&lt;/pre>

=== 21番染色体上にある構造既知蛋白質 ===

&lt;pre>
prefix PDBo: &lt;http://www.pdbj.org/schema/pdbx-v32.owl#>
prefix Hinv: &lt;http://hinv.jp/hinv.owl#>
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#>

select ?s ?band ?pdbidU ?title  where {
 ?s Hinv:CHROMOSOME-NUMBER '21' .
 ?s Hinv:CHROMOSOME-BAND ?band .
 ?s Hinv:STRUCTURE_DB-REFERENCE_PDB ?pdbid .
 ?pdbidU rdfs:sameAs ?pdbid .
 ?pdbidU PDBo:structCategory  ?struct .
 ?struct PDBo:struct.title ?title .
} 
&lt;/pre>

=== 各染色体上にある酵素の種類と数 ===
&lt;pre>
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#>
prefix PDBo: &lt;http://www.pdbj.org/schema/pdbx-v32.owl#>
prefix Hinv: &lt;http://hinv.jp/hinv.owl#>

select ?cn ?ec count(*) where {
 ?s Hinv:CHROMOSOME-NUMBER ?cn .
 ?s Hinv:STRUCTURE_DB-REFERENCE_PDB ?pdbid .
 ?pdbidU rdfs:sameAs ?pdbid .
 ?pdbidU PDBo:entityCategory  ?entity .
 ?entity PDBo:link_to_enzyme ?ec .
} 
group by ?cn ?ec
order by ?cn ?ec

&lt;/pre>

=== 解像度が2.0Åより良い構造が解けている蛋白質とそれが存在する染色体領域 ===
&lt;pre>
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#>
prefix PDBo: &lt;http://www.pdbj.org/schema/pdbx-v32.owl#>
prefix Hinv: &lt;http://hinv.jp/hinv.owl#>

select ?cn ?s ?pdb ?res {
 ?s Hinv:CHROMOSOME-NUMBER ?cn .
 ?s Hinv:STRUCTURE_DB-REFERENCE_PDB ?pdb .
 ?pdbU rdfs:sameAs ?pdb .
 ?pdbU PDBo:refineCategory ?refine .
 ?refine PDBo:refine.ls_d_res_high ?res .
 FILTER(xsd:decimal(?res) &lt; xsd:decimal(2.0))
}
order by ?cn xsd:decimal(?res)
&lt;/pre>
* FILTER中で数値を比較する際、xsd:decimal に注意！
* order by の挙動が変？

=== 脳で発現している構造既知の酵素 ===
&lt;pre>
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#>
prefix PDBo: &lt;http://www.pdbj.org/schema/pdbx-v32.owl#>
prefix Hinv: &lt;http://hinv.jp/hinv.owl#>

select ?s ?cn ?tissue ?pdbid ?ec where {
 ?s Hinv:CHROMOSOME-NUMBER ?cn .
 ?s Hinv:TISSUE-TYPE-ORIGIN_ORIGINAL ?tissue .
 FILTER regex(?tissue, "brain")
 ?s Hinv:STRUCTURE_DB-REFERENCE_PDB ?pdbid .
 ?pdbidU rdfs:sameAs ?pdbid .
 ?pdbidU PDBo:entityCategory  ?entity .
 ?entity PDBo:link_to_enzyme ?ec .
} 
&lt;/pre>

= 結果 =
# H-invDB の蛋白質データの一部 XPROTEIN_1 をとってきた。
# XPROTEIN_1 のバグを取った。
# XPROTEIN_1 全部のデータ(50000件)をロードした場合は transaction time out で結果が得られず。
# XPROTEIN_1 の一部(1264件)をロードした。それに含まれるPDBエントリは574エントリ。
#* この程度は楽に検索できる。
#* 次の日に、より多くのデータをロードしてみた。H-invDB→2539エントリ、PDB→1017エントリ。これでも一瞬で検索できる。

= 参考文献 =
# [http://www.amazon.co.jp/dp/4627829310 セマンティック・ウェブのためのRDF/OWL入門] 神崎 正英 (著)  
#* RDFとOWLの分かりやすい説明。
# [http://www.amazon.co.jp/dp/0123735564 Semantic Web for the Working Ontologist: Effective Modeling in RDFS and OWL] Dean Allemang (著), James Hendler (著)
#* [http://www.amazon.co.jp/dp/4883093247 実践セマンティックWeb―RDF/RDFS/OWLによるオントロジー設計ガイド] （日本語訳）
# [http://www.amazon.co.jp/dp/4873114527 セマンティックWeb プログラミング] Toby Segaran (著), Colin Evans (著), Jamie Taylor (著),
#* より実践的な解説
# [http://www.amazon.co.jp/dp/4274207455 記述論理とWebオントロジー言語] 兼岩 憲 (著)
#* 理論的背景
# [http://www.amazon.co.jp/dp/0131873253 Database Systems: The Complete Book (2nd Edition)] Hector Garcia-Molina (著), Jeffrey D. Ullman (著), Jennifer Widom (著)  
#*  データベースとXMLの関係、マッピングの仕方

= 付録 =

== H-invDB のHIPのXMLをRDFに変換するスタイルシート(一部アイテムのみ対応) ==
&lt;pre>
&lt;?xml version="1.0" encoding="UTF-8"?>
&lt;xsl:stylesheet
   version="2.0"
   xmlns:xsl="http://www.w3.org/1999/XSL/Transform"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   xmlns:PDBx="http://pdbml.pdb.org/schema/pdbx-v32.xsd"
   xmlns:Hinv="http://hinv.jp/hinv.owl#"
   xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#"
   xmlns:rdf="http://www.w3.org/1999/02/22-rdf-syntax-ns#"
   >
  &lt;xsl:output method="xml" indent="yes"/>
  &lt;xsl:strip-space elements="*"/>

  &lt;xsl:template match="/H-Inv">
    &lt;rdf:RDF>
      &lt;xsl:apply-templates/>
    &lt;/rdf:RDF>
  &lt;/xsl:template>

  &lt;xsl:template match="HIP">
    &lt;rdf:Description rdf:about="http://www.h-invitational.jp/hinv/protein/protein_view.cgi?hip_id={H-INVITATIONAL-PROTEIN-ID}">
      &lt;xsl:apply-templates/>
    &lt;/rdf:Description>
  &lt;/xsl:template>

  &lt;xsl:template match="H-INVITATIONAL-PROTEIN-ID">
    &lt;Hinv:H-INVITATIONAL-PROTEIN-ID>
	&lt;xsl:value-of select="."/>
    &lt;/Hinv:H-INVITATIONAL-PROTEIN-ID>
  &lt;/xsl:template>

  &lt;xsl:template match="H-INVITATIONAL-ID">
    &lt;Hinv:H-INVITATIONAL-ID>
http://www.h-invitational.jp/hinv/spsoup/transcript_view?hit_id=&lt;xsl:value-of select="."/>
    &lt;/Hinv:H-INVITATIONAL-ID>
  &lt;/xsl:template>

  &lt;xsl:template match="CLUSTER-ID">
    &lt;Hinv:CLUSTER-ID>
      http://www.h-invitational.jp/hinv/spsoup/locus_view?hix_id=&lt;xsl:value-of select="."/>
    &lt;/Hinv:CLUSTER-ID>
  &lt;/xsl:template>

  &lt;xsl:template match="CDNA_DB-REFERENCE_ENSEMBL">
    &lt;Hinv:CDNA_DB-REFERENCE_ENSEMBL>
      http://www.ensembl.org/Homo_sapiens/Transcript/Transcript?t=&lt;xsl:value-of select="."/>
    &lt;/Hinv:CDNA_DB-REFERENCE_ENSEMBL>
  &lt;/xsl:template>

  &lt;xsl:template match="CDNA_DB-REFERENCE_UNIPROT-PROTEIN-ID">
    &lt;Hinv:CDNA_DB-REFERENCE_UNIPROT-PROTEIN-ID>
      http://purl.uniprot.org/uniprot/&lt;xsl:value-of select="."/>
    &lt;/Hinv:CDNA_DB-REFERENCE_UNIPROT-PROTEIN-ID>
  &lt;/xsl:template>

  &lt;xsl:template match="CDNA_DB-REFERENCE_PUBMED">
    &lt;Hinv:CDNA_DB-REFERENCE_PUBMED>
      http://www.ncbi.nlm.nih.gov/pubmed/&lt;xsl:value-of select="."/>
    &lt;/Hinv:CDNA_DB-REFERENCE_PUBMED>
  &lt;/xsl:template>

  &lt;xsl:template match="CHROMOSOME-NUMBER">
      &lt;Hinv:CHROMOSOME-NUMBER>
	&lt;xsl:value-of select="."/>
      &lt;/Hinv:CHROMOSOME-NUMBER>
  &lt;/xsl:template>
  &lt;xsl:template match="CHROMOSOME-BAND">
      &lt;Hinv:CHROMOSOME-BAND>
	&lt;xsl:value-of select="."/>
      &lt;/Hinv:CHROMOSOME-BAND>
  &lt;/xsl:template>

  &lt;xsl:template match="STRUCTURE_DB-REFERENCE_PDB">
    &lt;Hinv:STRUCTURE_DB-REFERENCE_PDB rdf:resource="http://www.pdbj.org/xpath/{substring(.,1,4)}"/>
  &lt;/xsl:template>

  &lt;xsl:template match="TISSUE-TYPE-ORIGIN_ORIGINAL">
    &lt;Hinv:TISSUE-TYPE-ORIGIN_ORIGINAL>
      &lt;xsl:value-of select="."/>
    &lt;/Hinv:TISSUE-TYPE-ORIGIN_ORIGINAL>
  &lt;/xsl:template>

  &lt;xsl:template match="*">
      &lt;xsl:apply-templates/>
  &lt;/xsl:template>

  &lt;xsl:template match="text()"/>
&lt;/xsl:stylesheet>

&lt;/pre>

== Virtuoso tips ==

=== データのロード ===
/tmp/kk.ttl にturtle formatのデータがあるとする。
"http://www.pdbj.org" という名前のグラフに三つ組みを
入れる。
&lt;pre>
 isql 1111 dba dba &lt;&lt;EOF
DB.DBA.TTLP_MT(file_to_string_output('/tmp/kk.ttl'), '' ,'http://www.pdbj.org',0);
checkpoint;
EOF
&lt;/pre>

=== データの削除 ===
"http://www.pdbj.org" という名前のグラフにあるデータをすべて削除する。
&lt;pre>
 isql 1111 dba dba &lt;&lt;EOF
sparql clear graph &lt;http://www.pdbj.org>;
EOF
&lt;/pre>

= まとめ =
== 実際やったこと ==
# PDBjのRDFをつくるXSLを一部修正した。
# H-invDB (protein) のデータの一部をXMLからRDFに変換するXSLスタイルシートを作った。
# H-invDB (protein) の2539エントリとそれに対応するPDBエントリ (1017) を Virtuoso にロードした。
# いくつかのSPARQL クエリを試した。

== 苦労した点 ==
* H-invDB の XML ファイルがvalidでなかった。（特殊文字のエスケープ）
* 全部のデータは8GBのメモリには載らないので、検索が"transaction time out" になってしまった。

それでも思ったよりすんなり検索のデモまでできた。

== 残された課題 ==
* H-invDB のOWLオントロジーの定義、完全なRDF化
* 全データを実際にロードして検索を実行すること。

== H-invDBのXML形式について(改良の要望) ==
* 何はともあれ特殊文字のエスケープ "&amp;"→"&amp;amp;amp;" "&lt;" → "&amp;amp;lt;" ">" → "&amp;amp;gt;"
* H-invDB のXMLファイルには属性(attribute)がない。
** →データの項目のPrimary key に相当するようなアイテムは属性にすべき。
** その利点は、字面からどれがprimary key になるかが分かるので、各エントリのデータ項目毎にURIが定義できて、より細かい粒度のRDFトリプルが定義できて、その変換が簡単になること(XSLスタイルシートが規則的に書ける）。

RDBとXMLの関係については、上記[[#参考文献|参考文献]]中のDatabase Systems: The Complete Book を参照のこと。

=== 案 ===
H-invの実情を知らないので、ちょっとアレですが、たとえば、
&lt;pre>
   &lt;HIP>
    &lt;H-INVITATIONAL-PROTEIN-ID>HIP000000308&lt;/H-INVITATIONAL-PROTEIN-ID>
    &lt;H-INVITATIONAL-PROTEIN-ID-VERSION>HIP000000308.1&lt;/H-INVITATIONAL-PROTEIN-ID-VERSION>
    &lt;DATE-LAST-UPDATE>16-Feb-2010&lt;/DATE-LAST-UPDATE>
    &lt;DATE-LAST-MODIFIED>16-Feb-2010&lt;/DATE-LAST-MODIFIED>
    &lt;CDNA_H-INV-DB-RELEASE>7.5&lt;/CDNA_H-INV-DB-RELEASE>
    &lt;PROTEIN_DATE-LAST-UPDATE>16-Feb-2010&lt;/PROTEIN_DATE-LAST-UPDATE>
    &lt;PROTEIN_DATE-LAST-MODIFIED>16-Feb-2010&lt;/PROTEIN_DATE-LAST-MODIFIED>
    &lt;HIP-RELEASE>7.3&lt;/HIP-RELEASE>
    &lt;REPRESENTATIVE>
      &lt;H-INVITATIONAL-ID>HIT000036345&lt;/H-INVITATIONAL-ID>
      &lt;H-INVITATIONAL-ID-VERSION>HIT000036345.16&lt;/H-INVITATIONAL-ID-VERSION>
      &lt;CLUSTER-ID>HIX0013821&lt;/CLUSTER-ID>
....
&lt;/pre>
となっているところを、
&lt;pre>
  &lt;HIP ID="HIP000000308">
    &lt;H-INVITATIONAL-PROTEIN-ID-VERSION>HIP000000308.1&lt;/H-INVITATIONAL-PROTEIN-ID-VERSION>
    &lt;DATE-LAST-UPDATE>16-Feb-2010&lt;/DATE-LAST-UPDATE>
    &lt;DATE-LAST-MODIFIED>16-Feb-2010&lt;/DATE-LAST-MODIFIED>
    &lt;CDNA_H-INV-DB-RELEASE>7.5&lt;/CDNA_H-INV-DB-RELEASE>
    &lt;PROTEIN_DATE-LAST-UPDATE>16-Feb-2010&lt;/PROTEIN_DATE-LAST-UPDATE>
    &lt;PROTEIN_DATE-LAST-MODIFIED>16-Feb-2010&lt;/PROTEIN_DATE-LAST-MODIFIED>
    &lt;HIP-RELEASE>7.3&lt;/HIP-RELEASE>
    &lt;REPRESENTATIVE ID="HIT000036345">
      &lt;H-INVITATIONAL-ID-VERSION>HIT000036345.16&lt;/H-INVITATIONAL-ID-VERSION>
      &lt;CLUSTER-ID>HIX0013821&lt;/CLUSTER-ID>
 ....
&lt;/pre>
とするとか（"HIP"タグと"REPRESENTATIVE"タグに注目)。
そうすると、たとえば、

* http://hinv.jp/protein/HIP000163250 (fake です)
のみならず、
* http://hinv.jp/protein/HIP000163250/representative/HIT000036345 (fake です)

みたいなURLがXMLデータの'''字面だけから'''推定できます。現状だと、XMLファイルの意味を'''人間が'''理解した上で、RDFやURLへの変換ルールを
書く必要があります。さらに、
&lt;pre>
&lt;http://hinv.jp/protein/HIP000163250> &lt;http://hinv.jp/hinv.owl#DATE-LAST-MODIFIED> "16-Feb-2010" .
&lt;/pre>
のようなエントリ単位のトリプルのみならず、
&lt;pre>
&lt;http://hinv.jp/protein/HIP000163250> &lt;http://hinv.jp/hinv.owl#hasRepresentative> &lt;http://hinv.jp/protein/HIP000163250/representative/HIT000036345> .
&lt;http://hinv.jp/protein/HIP000163250/representative/HIT000036345> &lt;http://hinv.jp/hinv.owl#CLUSTER-ID> "HIX0013821" .

&lt;/pre>
のようなエントリ内の項目単位のトリプルも可能になります。
[[Category:bh10.10]]</textarea><div class='templatesUsed'>

</div>
<p id="mw-returnto"><a href="データベースのRDF化.html" title="データベースのRDF化">データベースのRDF化</a>に戻る。</p>
<div class="printfooter">
「<a href="データベースのRDF化.html">http://wiki.lifesciencedb.jp/mw/%E3%83%87%E3%83%BC%E3%82%BF%E3%83%99%E3%83%BC%E3%82%B9%E3%81%AERDF%E5%8C%96</a>」より作成</div>
		<div id='catlinks' class='catlinks catlinks-allhidden'></div>		<!-- end content -->
				<div class="visualClear"></div>
	</div>
</div></div>
<div id="column-one">
	<div id="p-cactions" class="portlet">
		<h5>表示</h5>
		<div class="pBody">
			<ul>
				 <li id="ca-nstab-main" class="selected"><a href="データベースのRDF化.html" title="本文を表示 [c]" accesskey="c">ページ</a></li>
				 <li id="ca-talk" class="new"><a href="http://wiki.lifesciencedb.jp/mw/index.php?title=%E3%83%8E%E3%83%BC%E3%83%88:%E3%83%87%E3%83%BC%E3%82%BF%E3%83%99%E3%83%BC%E3%82%B9%E3%81%AERDF%E5%8C%96&amp;action=edit&amp;redlink=1" title="記事についての議論 [t]" accesskey="t">議論</a></li>
				 <li id="ca-viewsource" class="selected"><a href="index.php@title=データベースのRDF化&amp;action=edit.html" title="このページは保護されています。&#10;ページのソースを閲覧できます。 [e]" accesskey="e">ソースを表示</a></li>
				 <li id="ca-history"><a href="index.php@title=データベースのRDF化&amp;action=history.html" title="このページの過去の版 [h]" accesskey="h">履歴</a></li>
			</ul>
		</div>
	</div>
	<div class="portlet" id="p-personal">
		<h5>個人用ツール</h5>
		<div class="pBody">
			<ul>
				<li id="pt-anonuserpage"><a href="http://wiki.lifesciencedb.jp/mw/%E5%88%A9%E7%94%A8%E8%80%85:172.18.8.51" title="自分が編集しているIPアドレスの利用者ページ [.]" accesskey="." class="new">172.18.8.51</a></li>
				<li id="pt-anontalk"><a href="http://wiki.lifesciencedb.jp/mw/%E5%88%A9%E7%94%A8%E8%80%85%E2%80%90%E4%BC%9A%E8%A9%B1:172.18.8.51" title="このIPアドレスからなされた編集についての議論 [n]" accesskey="n" class="new">このIPアドレスのトーク</a></li>
				<li id="pt-anonlogin"><a href="http://wiki.lifesciencedb.jp/mw/index.php?title=%E7%89%B9%E5%88%A5:%E3%83%AD%E3%82%B0%E3%82%A4%E3%83%B3&amp;returnto=%E3%83%87%E3%83%BC%E3%82%BF%E3%83%99%E3%83%BC%E3%82%B9%E3%81%AERDF%E5%8C%96&amp;returntoquery=action%3Dedit" title="ログインすることが推奨されます。ただし、必須ではありません。 [o]" accesskey="o">ログイン</a></li>
				<li id="pt-openidlogin"><a href="index.php@title=特別%253AOpenIDログイン&amp;returnto=データベースのRDF化.html">OpenIDでログイン</a></li>
			</ul>
		</div>
	</div>
	<div class="portlet" id="p-logo">
		<a style="background-image: url(http://wiki.lifesciencedb.jp/mw/images/togowiki-logo.png);" href="index.html" title="メインページに移動"></a>
	</div>
	<script type="text/javascript"> if (window.isMSIE55) fixalpha(); </script>
	<div class='generated-sidebar portlet' id='p-navigation'>
		<h5>案内</h5>
		<div class='pBody'>
			<ul>
				<li id="n-mainpage-description"><a href="index.html" title="メインページに移動する [z]" accesskey="z">メインページ</a></li>
				<li id="n-portal"><a href="http://wiki.lifesciencedb.jp/mw/TogoWiki:%E3%82%B3%E3%83%9F%E3%83%A5%E3%83%8B%E3%83%86%E3%82%A3%E3%83%BB%E3%83%9D%E3%83%BC%E3%82%BF%E3%83%AB" title="このプロジェクトについて、できること、情報を入手する場所">コミュニティ・ポータル</a></li>
				<li id="n-currentevents"><a href="http://wiki.lifesciencedb.jp/mw/TogoWiki:%E6%9C%80%E8%BF%91%E3%81%AE%E5%87%BA%E6%9D%A5%E4%BA%8B" title="最近の出来事について予備知識を得る">最近の出来事</a></li>
				<li id="n-recentchanges"><a href="http://wiki.lifesciencedb.jp/mw/%E7%89%B9%E5%88%A5:%E6%9C%80%E8%BF%91%E3%81%AE%E6%9B%B4%E6%96%B0" title="ウィキにおける最近の更新の一覧 [r]" accesskey="r">最近の更新</a></li>
				<li id="n-randompage"><a href="http://wiki.lifesciencedb.jp/mw/%E7%89%B9%E5%88%A5:%E3%81%8A%E3%81%BE%E3%81%8B%E3%81%9B%E8%A1%A8%E7%A4%BA" title="無作為に抽出されたページの読み込み [x]" accesskey="x">おまかせ表示</a></li>
				<li id="n-help"><a href="http://wiki.lifesciencedb.jp/mw/Help:%E7%9B%AE%E6%AC%A1" title="情報を得る場所">ヘルプ</a></li>
			</ul>
		</div>
	</div>
	<div id="p-search" class="portlet">
		<h5><label for="searchInput">検索</label></h5>
		<div id="searchBody" class="pBody">
			<form action="http://wiki.lifesciencedb.jp/mw/index.php" id="searchform">
				<input type='hidden' name="title" value="特別:検索"/>
				<input id="searchInput" title="TogoWiki内を検索" accesskey="f" type="search" name="search" />
				<input type='submit' name="go" class="searchButton" id="searchGoButton"	value="表示" title="厳密に一致する名前のページが存在すれば、そのページへ移動します" />&nbsp;
				<input type='submit' name="fulltext" class="searchButton" id="mw-searchButton" value="検索" title="入力された文字列が含まれるページを検索します" />
			</form>
		</div>
	</div>
	<div class="portlet" id="p-tb">
		<h5>ツールボックス</h5>
		<div class="pBody">
			<ul>
				<li id="t-whatlinkshere"><a href="特別%253Aリンク元/データベースのRDF化.html" title="ここにリンクしている全ウィキのページの一覧 [j]" accesskey="j">リンク元</a></li>
				<li id="t-recentchangeslinked"><a href="特別%253A関連ページの更新状況/データベースのRDF化.html" title="このページからリンクしているページの最近の更新 [k]" accesskey="k">関連ページの更新状況</a></li>
<li id="t-specialpages"><a href="http://wiki.lifesciencedb.jp/mw/%E7%89%B9%E5%88%A5:%E7%89%B9%E5%88%A5%E3%83%9A%E3%83%BC%E3%82%B8%E4%B8%80%E8%A6%A7" title="特別ページの一覧 [q]" accesskey="q">特別ページ</a></li>
			</ul>
		</div>
	</div>
</div><!-- end of the left (by default at least) column -->
<div class="visualClear"></div>
<div id="footer">
	<div id="f-poweredbyico"><a href="http://www.mediawiki.org/"><img src="http://wiki.lifesciencedb.jp/mw/skins/common/images/poweredby_mediawiki_88x31.png" height="31" width="88" alt="Powered by MediaWiki" /></a></div>
	<div id="f-copyrightico"><a href="http://creativecommons.org/licenses/by/3.0/"><img src="http://i.creativecommons.org/l/by/3.0/88x31.png" alt="Attribution 3.0 Unported" width="88" height="31" /></a></div>
	<ul id="f-list">
		<li id="privacy"><a href="http://wiki.lifesciencedb.jp/mw/TogoWiki:%E3%83%97%E3%83%A9%E3%82%A4%E3%83%90%E3%82%B7%E3%83%BC%E3%83%BB%E3%83%9D%E3%83%AA%E3%82%B7%E3%83%BC" title="TogoWiki:プライバシー・ポリシー">プライバシー・ポリシー</a></li>
		<li id="about"><a href="http://wiki.lifesciencedb.jp/mw/TogoWiki:TogoWiki%E3%81%AB%E3%81%A4%E3%81%84%E3%81%A6" title="TogoWiki:TogoWikiについて">TogoWikiについて</a></li>
		<li id="disclaimer"><a href="http://wiki.lifesciencedb.jp/mw/TogoWiki:%E5%85%8D%E8%B2%AC%E4%BA%8B%E9%A0%85" title="TogoWiki:免責事項">免責事項</a></li>
	</ul>
</div>
</div>

<script>if (window.runOnloadHook) runOnloadHook();</script>
<!-- Served in 0.353 secs. --></body></html>
